[
    {
        "Author": "V. K. Mehta ,  Rohit Mehta",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/71/8d/5f/718d5f3667dc90310c5972a5b88244ed.jpg",
        "Department": "EEE",
        "Description": "The general response to the Fifth Edition of the book was very encouraging. Authors feel that their work has been amply rewarded and wish to express their deep sense of gratitude to the large number of readers who have used it and in particular to those of them who have sent helpful suggestions from time to time for the improvement of the book. \nThe popularity of the book is judged from the fact that authors frequently receive feedback from many quarters including teachers, students and serving engineers. This feedback helps the authors to make the book up-to-date. In the present edition, many new topics/numericals/illustrations have been added to make the book more useful.\n Authors lay no claim to the original research in preparing the book. Liberal use of materials available in the works of eminent authors has been made. What they may claim, in all modesty, is that they have tried to fashion the vast amount of material available from primary and secondary sources into coherent body of description and analysis.",
        "InStock": false,
        "Name": "Basic Electrical Engineering",
        "Stock": 0,
        "Year": 1,
        "_id": "56b0bdb0cb"
    },
    {
        "Author": "John Bird",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/fe/81/aa/fe81aa6f6d11c07b98342d7c49e72f5d.jpg",
        "Department": "EEE",
        "Description": "A fully comprehensive text for courses in electrical principles, circuit theory and electrical technology, providing 800 worked examples and over 1,350 further problems for students to work through at their own pace. This book is ideal for students studying engineering for the first time as part of BTEC National and other pre-degree vocational courses, as well as Higher Nationals, Foundation Degrees and first-year undergraduate modules.",
        "InStock": true,
        "Name": "Electrical Circuit Theory and Technology",
        "Stock": 18,
        "Year": 1,
        "_id": "1e1e915ab0"
    },
    {
        "Author": "Narayana ,  K L ,  Kannaiah ,  P ,  Reddy ,  K Venkata",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/02/ca/af/02caaf487dc2cdc994d92c941b25aa71.jpg",
        "Department": "Mechanical",
        "Description": "Overview: Intended for diploma and degree students of Mechanical Engineering as well as those preparing for AMIE examination, this work includes the features of assembly drawings, part drawings and computer-aided drawings to cater to the needs of students pursuing various courses.",
        "InStock": true,
        "Name": "Machine Drawing for Engineers, Third Edition",
        "Stock": 25,
        "Year": 1,
        "_id": "15c047acd0"
    },
    {
        "Author": "Artes Jason.",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1a/ad/13/1aad138b72dd6a7d149da8c9592c48a5.jpg",
        "Department": "CSE",
        "Description": "12CAD.com, Amazon Digital Services, Inc., 2015. — 108 р.Do you want to learn how to design 2D and 3D models in your favorite Computer Aided Design (CAD) software such as AutoCAD or SolidWorks? Look no further. We have designed 100 CAD exercises that will help you take your design skills to the next level. \nWhat's included in the 100 CAD Exercises book?\nWhether you are a beginner or an expert, these CAD exercises will challenge you. The book contains 50 2D and 50 3D exercises. \n- Each exercise contains images of the final design and exact measurements needed to create the design.\n- Each exercise can be designed on any CAD software you desire. It can be done with AutoCAD, SolidWorks, CATIA, DraftSight, and many more.",
        "InStock": false,
        "Name": "100 CAD Exercises - Learn by Practicing!: Learn to design 2D and 3D Models by Practicing with these 100 CAD Exercises!",
        "Stock": 0,
        "Year": 1,
        "_id": "1a0d43e4a3"
    },
    {
        "Author": "Mark Richards",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d4/f2/4f/d4f24faeff960b9652e9fd6c880bd300.jpg",
        "Department": "ISE",
        "Description": "The success of any application or system depends on the architecture pattern you use. By describing the overall characteristics of the architecture, these patterns not only guide designers and developers on how to design components, but also determine the ways in which those components should interact.\nThis O’Reilly report takes a deep dive into many common software architecture patterns. Each pattern includes a full explanation of how it works, explains the pattern’s benefits and considerations, and describes the circumstances and conditions it was designed to address. The report also includes an analysis and scorecard for each pattern based on several architecture and software development quality attributes.",
        "InStock": true,
        "Name": "Software Architecture Patterns",
        "Stock": 24,
        "Year": 1,
        "_id": "1e74fac5a5"
    },
    {
        "Author": "Jonathan Valvano",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/8c/63/13/8c631303dd797b0ce375121e266d4df1.jpg",
        "Department": "ECE",
        "Description": "This book, now in its fourth edition, is the second in a series of three books that teach the fundamentals of embedded systems as applied to ARM® Cortex™-M microcontrollers. The three books are primarily written for undergraduate electrical and computer engineering students. They could also be used for professionals learning the ARM platform. The first book Embedded Systems: Introduction to ARM® Cortex™-M Microcontrollers is an introduction to computers and interfacing focusing on assembly language and C programming. This second book focuses on interfacing and the design of embedded systems. The third book Embedded Systems: Real-Time Operating Systems for ARM® Cortex™-M Microcontrollers is an advanced book focusing on operating systems, high-speed interfacing, control systems, and robotics.   \nAn embedded system is a system that performs a specific task and has a computer embedded inside. Topics include microcontrollers, design, verification, hardware/software synchronization, interfacing devices to the computer, timing diagrams, real-time systems, data collection and processing, motor control, analog filters, digital filters, and real-time signal processing.\nIn general, the area of embedded systems is an important and growing discipline within electrical and computer engineering. The educational market of embedded system is dominated by simple microcontrollers like the PIC, 9S12, and 8051. This is because of their market share, low cost, and historical dominance. However, as problems become more complex, so must the systems that solve them. A number of embedded system paradigms must shift in order to accommodate this growth in complexity. First, the number of calculations per second will increase from about 1 million/sec to 1 billion/sec. Similarly, the number of lines of software code will also increase from 1000’s to 10 to 100 million. Thirdly, systems will involve multiple microcontrollers supporting many simultaneous operations. Lastly, the need for system verification will continue to grow as these systems are deployed into safety critical applications. These changes are more than a simple growth in size and bandwidth. These systems must employ parallel programming, DMA synchronization, real-time operating systems, fault tolerant design, priority interrupt handling, and networking. Consequently, it will be important to provide our students with these types of design experiences. The ARM platform is both low cost and provides the high performance features required in future embedded systems. The ARM market share is currently large and growing. Furthermore, students trained on the ARM will be equipped to design systems across the complete spectrum from simple to complex. The purpose of writing this book at this time is to bring engineering education into the 21st century.\nThis book employs many approaches to learning. It will not include an exhaustive recapitulation of the information in data sheets. First, it begins with basic fundamentals, which allows the reader to solve new problems with new technology. Second, the book presents many detailed design examples. These examples illustrate the process of design. There are multiple structural components that assist learning. Checkpoints, with answers in the back, are short easy to answer questions providing immediate feedback while reading. Simple homework, with answers to the odd questions on the web, provide more detailed learning opportunities. The book includes an index and a glossary so that information can be searched. The most important learning experience in a class like this are of course the laboratories. Each chapter has suggested lab assignments. More detailed lab descriptions are available on the web.\nThe book will cover embedded systems for the ARM® Cortex™-M with specific details on the LM3S811, LM3S1968,TM4C123 and TM4C1294.  Although the solutions are specific for the TI LM3S and TM4C, it will be possible to use this book for other ARM derivatives.",
        "InStock": true,
        "Name": "Embedded Systems: Real-Time Interfacing to ARM Cortex-M Microcontrollers",
        "Stock": 18,
        "Year": 1,
        "_id": "cb4af555e4"
    },
    {
        "Author": "Tertulien Ndjountche",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/81/b2/55/81b255673be868eddda06bf19e429dbe.jpg",
        "Department": "ECE",
        "Description": "The omnipresence of electronic devices in our everyday lives has been accompanied by the downscaling of chip feature sizes and the ever increasing complexity of digital circuits.\n \nThis book is devoted to the analysis and design of digital circuits, where the signal can assume only two possible logic levels. It deals with the basic principles and concepts of digital electronics. It addresses all aspects of combinational logic and provides a detailed understanding of logic gates that are the basic components in the implementation of circuits used to perform functions and operations of Boolean algebra. Combinational logic circuits are characterized by outputs that depend only on the actual input values.\n \nEfficient techniques to derive logic equations are proposed together with methods of analysis and synthesis of combinational logic circuits. Each chapter is well structured and is supplemented by a selection of solved exercises covering logic design practices.",
        "InStock": false,
        "Name": "Digital Electronics, Volume 1: Combinational Logic Circuits",
        "Stock": 0,
        "Year": 1,
        "_id": "115-115-121-1"
    },
    {
        "Author": "Behrouz A. Forouzan ,  Richard Gilberg",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d6/8f/61/d68f6199646ca63591a6d8419e0ed4ba.jpg",
        "Department": "CSE",
        "Description": "C++ Programming: An Object-Oriented Approach has two primary objectives: Teach the basic principles of programming as outlined in the ACM curriculum for a CS1 class and teach the basic constructs of the C++ language. While C++ is a complex and professional language, experience shows that beginning students can easily understand and use C++. C++ Programming: An Object-Oriented Approach uses a combination of thorough, well-ordered explanations and a strong visual framework to make programming concepts accessible to students. The authors stress incremental program development, wherein program analysis is followed by building a structure chart, constructing UML flow diagrams, writing algorithms, undertaking program design, and finally testing. This foundation, combined with a focus on the benefits of a consistent and well-documented programming style, prepares students to tackle the academic and professional programming challenges they will encounter down the road with confidence.",
        "InStock": true,
        "Name": "C++ Programming: An Object-Oriented Approach",
        "Stock": 7,
        "Year": 1,
        "_id": "1260547728"
    },
    {
        "Author": "Stefano Crespi Reghizzi ,  Luca Breveglieri ,  Angelo Morzenti",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/43/22/d1/4322d1ce74742599365f64e685d143a6.jpg",
        "Department": "ISE",
        "Description": "This classroom-tested and clearly-written textbook presents a focused guide to the conceptual foundations of compilation, explaining the fundamental principles and algorithms used for defining the syntax of languages, and for implementing simple translators.\n\n\n\r\nThis significantly updated and expanded third edition has been enhanced with additional coverage of regular expressions, visibly pushdown languages, bottom-up and top-down deterministic parsing algorithms, and new grammar models.\n\n\n\r\nTopics and features: describes the principles and methods used in designing syntax-directed applications such as parsing and regular expression matching; covers translations, semantic functions (attribute grammars), and static program analysis by data flow equations; introduces an efficient method for string matching and parsing suitable for ambiguous regular expressions (NEW); presents a focus on extended BNF grammars with their general parser and with LR(1) and LL(1) parsers (NEW); introduces a parallel parsing algorithm that exploits multiple processing threads to speed up syntax analysis of large files; discusses recent formal models of input-driven automata and languages (NEW); includes extensive use of theoretical models of automata, transducers and formal grammars, and describes all algorithms in pseudocode; contains numerous illustrative examples, and supplies a large set of exercises with solutions at an associated website.\n\n\n\r\nAdvanced undergraduate and graduate students of computer science will find this reader-friendly textbook to be an invaluable guide to the essential concepts of syntax-directed compilation. The fundamental paradigms of language structures are elegantly explained in terms of the underlying theory, without requiring the use of software tools or knowledge of implementation, and through algorithms simple enough to be practiced by paper and pencil.",
        "InStock": false,
        "Name": "Formal Languages and Compilation (3rd Edition)",
        "Stock": 0,
        "Year": 1,
        "_id": "978-3-030-04879-2"
    },
    {
        "Author": "Peter Linz",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/8e/1b/39/8e1b39d8df80facc4936a5571e276320.jpg",
        "Department": "CSE",
        "Description": "An Introduction to Formal Languages and Automata, Sixth Edition provides an accessible, student-friendly presentation of all material essential to an introductory Theory of Computation course. Written to address the fundamentals of formal languages, automata, and computability, the text is designed to familiarize students with the foundations and principles of computer science and to strengthen the students' ability to carry out formal and rigorous mathematical arguments. The author, Peter Linz, continues to offer a straightforward, uncomplicated treatment of formal languages and automata and avoids excessive mathematical detail allowing students to focus on and understand the key underlying principles.",
        "InStock": false,
        "Name": "An Introduction to Formal Languages and Automata",
        "Stock": 0,
        "Year": 1,
        "_id": "1284077241"
    },
    {
        "Author": "Lukas Novotny ,  Bert Hecht",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/c2/b7/b0/c2b7b0652655bf7a71cd10b6ce3e6751.jpg",
        "Department": "Physics",
        "Description": "Nano-optics is the study of optical phenomena and techniques on the nanometer scale, that is, near or beyond the diffraction limit of light. It is an emerging field of study, motivated by the rapid advance of nanoscience and nanotechnology which require adequate tools and strategies for fabrication, manipulation and characterization at this scale. In Principles of Nano-Optics the authors provide a comprehensive overview of the theoretical and experimental concepts necessary to understand and work in nano-optics. With a very broad perspective, they cover optical phenomena relevant to the nanoscale across diverse areas ranging from quantum optics to biophysics, introducing and extensively describing all of the significant methods. This is the first textbook specifically on nano-optics. Written for graduate students who want to enter the field, it includes problem sets to reinforce and extend the discussion. It is also a valuable reference for researchers and course teachers.",
        "InStock": false,
        "Name": "Principles of nano-optics",
        "Stock": 0,
        "Year": 1,
        "_id": "0521832241"
    },
    {
        "Author": "Amretashis Sengupta ,  Chandan Kumar Sarkar (eds.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/5e/9e/54/5e9e54b3ca56a5f4c904404078fdf4b2.jpg",
        "Department": "Physics",
        "Description": "This book covers the basics of nanotechnology and provides a solid understanding of the subject. Starting from a brush-up of the basic quantum mechanics and materials science, the book helps to gradually build up understanding of the various effects of quantum confinement, optical-electronic properties of nanoparticles and major nanomaterials. The book covers the various physical, chemical and hybrid methods of nanomaterial synthesis and nanofabrication as well as advanced characterization techniques. It includes chapters on the various applications of nanoscience and nanotechnology. It is written in a simple form, making it useful for students of physical and material sciences.",
        "InStock": true,
        "Name": "Introduction to Nano: Basics to Nanoscience and Nanotechnology",
        "Stock": 1,
        "Year": 1,
        "_id": "978-3-662-47314-6"
    },
    {
        "Author": "Y. Champion ,  H.-J. Fecht",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/6d/25/58/6d25584f1ba6784bfceec1d5ffa77c75.jpg",
        "Department": "Mechanical",
        "Description": "The book identifies new nanometric architectures that would be of particular interest for applications and the technological route to reach them. Nano-architectures of interest are for optical, electrical, magnetic, mechanical properties and reactivity as well as for specific applications such as catalysis and medical diagnostic and drug delivery. Nano-architectures would be metals, alloys, ceramics, semi-conductors, polymers or hybrids inorganic-polymers materials.\nThe book places special emphasis on crucial technical aspects of the fabrication, the control and the characterisation of complex nano-architectures.",
        "InStock": true,
        "Name": "Nano-Architectured and Nanostructured Materials: Fabrication, Control and Properties",
        "Stock": 24,
        "Year": 1,
        "_id": "3527310088"
    },
    {
        "Author": "Chris Solomon ,  Toby Breckon",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/40/46/2a/40462aeb669c8b51248b99f939eb606c.jpg",
        "Department": "ISE",
        "Description": "This is an introductory to intermediate level text on the science of image processing, which employs the Matlab programming language to illustrate some of the elementary, key concepts in modern image processing and pattern recognition. The approach taken is essentially practical and the book offers a framework within which the concepts can be understood by a series of well chosen examples, exercises and computer experiments, drawing on specific examples from within science, medicine and engineering.Clearly divided into eleven distinct chapters, the book begins with a fast-start introduction to image processing  to enhance the accessibility of later topics. Subsequent chapters offer increasingly advanced discussion of topics involving more challenging concepts, with  the final chapter  looking at the application of automated image classification (with Matlab examples) .Matlab is frequently used in the book as a tool for demonstrations, conducting experiments and for solving problems, as it is both ideally suited to this role and is widely available. Prior experience of Matlab is not required and those without access to Matlab can still benefit from the independent presentation of topics and numerous examples.Features a companion website www.wiley.com/go/solomon/fundamentals containing a Matlab fast-start primer, further  exercises, examples, instructor resources and accessibility to all files corresponding to the examples and exercises within the book itself.Includes numerous examples, graded exercises and computer experiments to support both students and instructors alike.",
        "InStock": true,
        "Name": "Fundamentals of Digital Image Processing: A Practical Approach with Examples in Matlab",
        "Stock": 20,
        "Year": 1,
        "_id": "0470844736"
    },
    {
        "Author": "Jun Ni",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/e4/b8/27/e4b82754be9c00ce96472a987cfcdcfd.jpg",
        "Department": "Physics",
        "Description": "This book starts from a set of common basic principles to establish the formalisms in all areas of fundamental physics, including quantum field theory, quantum mechanics, statistical mechanics, thermodynamics, general relativity, electromagnetic field, and classical mechanics. Instead of the traditional pedagogic way, the author arranges the subjects and formalisms in a logical-sequential way, i.e. all the formulas are derived from the formulas before them. The formalisms are also kept self-contained. Most of the required mathematical tools are also given in the appendices. \n Although this book covers all the disciplines of fundamental physics, the book is concise and can be treated as an integrated entity. This is consistent with the aphorism that simplicity is beauty, unification is beauty, and thus physics is beauty. The book may be used as an advanced textbook by graduate students. It is also suitable for physicists who wish to have an overview of fundamental physics.\n Readership: This is an advanced graduate or postgraduate level book.",
        "InStock": true,
        "Name": "Principles of Physics: From Quantum Field Theory to Classical Mechanics",
        "Stock": 4,
        "Year": 1,
        "_id": "9814579394"
    },
    {
        "Author": "Ramamurti Shankar",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/34/35/47/343547036399ae46a243065b78bee30b.jpg",
        "Department": "ECE",
        "Description": "Providing a broad review of many techniques and their application to condensed matter systems, this book begins with a review of thermodynamics and statistical mechanics, before moving onto real and imaginary time path integrals and the link between Euclidean quantum mechanics and statistical mechanics. A detailed study of the Ising, gauge-Ising and XY models is included. The renormalization group is developed and applied to critical phenomena, Fermi liquid theory and the renormalization of field theories. Next, the book explores bosonization and its applications to one-dimensional fermionic systems and the correlation functions of homogeneous and random-bond Ising models. It concludes with Bohm-Pines and Chern-Simons theories applied to the quantum Hall effect.  Introducing the reader to a variety of techniques, it opens up vast areas of condensed matter theory for both graduate students and researchers in theoretical, statistical and condensed matter physics.",
        "InStock": true,
        "Name": "Quantum Field Theory and Condensed Matter: An Introduction",
        "Stock": 23,
        "Year": 1,
        "_id": "0521592100"
    },
    {
        "Author": "Perry Xiao",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/3d/90/b8/3d90b8b52c7b0c0a5c8ccc3df91c345a.jpg",
        "Department": "ECE",
        "Description": "A comprehensive and accessible introduction to the development of embedded systems and Internet of Things devices using ARM mbed\n\n\n\r\nDesigning Embedded Systems and the Internet of Things (IoT) with the ARM mbed offers an accessible guide to the development of ARM mbed and includes a range of topics on the subject from the basic to the advanced. ARM mbed is a platform and operating system based on 32-bit ARM Cortex-M microcontrollers. This important resource puts the focus on ARM mbed NXP LPC1768 and FRDM-K64F evaluation boards. NXP LPC1768 has powerful features such as a fast microcontroller, various digital and analog I/Os, various serial communication interfaces and a very easy to use Web based compiler. It is one of the most popular kits that are used to study and create projects. FRDM-K64F is relatively new and largely compatible with NXP LPC1768 but with even more powerful features.\n\n\n\r\nThis approachable text is an ideal guide that is divided into four sections; Getting Started with the ARM mbed, Covering the Basics, Advanced Topics and Case Studies. This getting started guide:\n\r\n• Offers a clear introduction to the topic\n\r\n• Contains a wealth of original and illustrative case studies\n\r\n• Includes a practical guide to the development of projects with the ARM mbed platform\n\r\n• Presents timely coverage of how to develop IoT applications\n\n\n\r\nDesigning Embedded Systems and the Internet of Things (IoT) with the ARM mbed offers students and R&D engineers a resource for understanding the ARM mbed NXP LPC1768 evaluation board.",
        "InStock": true,
        "Name": "Designing Embedded Systems and the Internet of Things (IoT) with the ARM® Mbed™",
        "Stock": 18,
        "Year": 1,
        "_id": "1119363993"
    },
    {
        "Author": "Rajesh Singh ,  Anita Gehlot ,  Bhupendra Singh ,  Sushabhan Choudhury",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/aa/e3/a8/aae3a8b7f0a35cbd46454e3202d0ce3e.jpg",
        "Department": "ECE",
        "Description": "Arduino is an open-source electronics platform based on easy-to-use hardware and software while LabVIEW is a graphical programming telling how to connect functions and work with a variety of datatypes when constructing applications.This book will help beginners to get started with Arduino-based embedded systems including essential know-how of the programming and interfacing of the devices. Book includes programming and simulation of Arduino-based projects and interfacing with LabVIEW, based on practical case studies. The book comprises of total twenty five chapters with description, working model of LabVIEW and programming with Arduino IDE",
        "InStock": false,
        "Name": "Arduino-Based Embedded Systems: Interfacing, Simulation, and LabVIEW GUI",
        "Stock": 0,
        "Year": 1,
        "_id": "978-1-315-16288-1"
    },
    {
        "Author": "Remzi H. Arpaci-Dusseau ,  Andrea C. Arpaci-Dusseau",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/83/fd/a9/83fda9bc51ba0735974a35c4a046e9d9.jpg",
        "Department": "CSE",
        "Description": "A book about modern operating systems. Topics are broken down into three major conceptual pieces: Virtualization, Concurrency, and Persistence. Includes all major components of modern systems including scheduling, virtual memory management, disk subsystems and I/O, file systems, and even a short introduction to distributed systems.",
        "InStock": false,
        "Name": "Operating Systems: Three Easy Pieces",
        "Stock": 0,
        "Year": 2,
        "_id": "9781105979125"
    },
    {
        "Author": "Jean-Philippe Aumasson",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/0d/73/cf/0d73cf9818d7da4f6260217301b663da.jpg",
        "Department": "ISE",
        "Description": "This practical guide to modern encryption breaks down the fundamental mathematical concepts at the heart of cryptography without shying away from meaty discussions of how they work. You’ll learn about authenticated encryption, secure randomness, hash functions, block ciphers, and public-key techniques such as RSA and elliptic curve cryptography. \nYou’ll also learn: \n- Key concepts in cryptography, such as computational security, attacker models, and forward secrecy \n- The strengths and limitations of the TLS protocol behind HTTPS secure websites \n- Quantum computation and post-quantum cryptography \n- About various vulnerabilities by examining numerous code examples and use cases \n- How to choose the best algorithm or protocol and ask vendors the right questions \nEach chapter includes a discussion of common implementation mistakes using real-world examples and details what could go wrong and how to avoid these pitfalls.  \nWhether you’re a seasoned practitioner or a beginner looking to dive into the field, \nSerious Cryptography\n will provide a complete survey of modern encryption and its applications.",
        "InStock": true,
        "Name": "Serious Cryptography: A Practical Introduction to Modern Encryption",
        "Stock": 30,
        "Year": 4,
        "_id": "1593278268"
    },
    {
        "Author": "Douglas R. Stinson ,  Maura B. Paterson",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/a9/71/12/a971124643304708c1a6066ec28438eb.jpg",
        "Department": "ISE",
        "Description": "Through three editions, Cryptography: Theory and Practice, has been embraced by instructors and students alike. It offers a comprehensive primer for the subject’s fundamentals while presenting the most current advances in cryptography.\n\r\nThe authors offer comprehensive, in-depth treatment of the methods and protocols that are vital to safeguarding the seemingly infinite and increasing amount of information circulating around the world.\n\n\n\r\nKey Features of the Fourth Edition:\n\r\n• New chapter on the exciting, emerging new area of post-quantum cryptography (Chapter 9).\n\r\n• New high-level, nontechnical overview of the goals and tools of cryptography (Chapter 1).\n\r\n• New mathematical appendix that summarizes definitions and main results on number theory and algebra (Appendix A).\n\r\n• An expanded treatment of stream ciphers, including common design techniques along with coverage of Trivium.\n\r\n• Interesting attacks on cryptosystems, including: padding oracle attack, correlation attacks and algebraic attacks on stream ciphers, attack on the DUAL-EC random bit generator that makes use of a trapdoor.\n\r\n• A treatment of the sponge construction for hash functions and its use in the new SHA-3 hash standard.\n\r\n• Methods of key distribution in sensor networks.\n\r\n• The basics of visual cryptography, allowing a secure method to split a secret visual message into pieces (shares) that can later be combined to reconstruct the secret.\n\r\n• The fundamental techniques cryptocurrencies, as used in Bitcoin and blockchain.\n\r\n• The basics of the new methods employed in messaging protocols such as Signal, including deniability and Diffie-Hellman key ratcheting.",
        "InStock": true,
        "Name": "Cryptography: Theory and Practice",
        "Stock": 16,
        "Year": 4,
        "_id": "1138197017"
    },
    {
        "Author": "Sartaj Sahni",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/66/e7/a7/66e7a7ec13809daf1d268be5e771b9d0.jpg",
        "Department": "CSE",
        "Description": "This text provides students with an introduction to data structures and algorithms. It emphasizes algorithm analysis and the development of efficient code, and includes important background material. Divided into three parts, the text features Data Structure Application sections at the end of each chapter in part two, Algorithm Application sections in each design method chapter in part three, and a gradual development of C++ features not found in C to help students with either a background in C or C++ to comprehend topics in the book.",
        "InStock": true,
        "Name": "Data Structures, Algorithms, And Applications In C++",
        "Stock": 3,
        "Year": 2,
        "_id": "0929306325"
    },
    {
        "Author": "Suman Saha ,  Shailendra Shukla",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/03/fe/c0/03fec09fae8e400360268e4d7e7869ec.jpg",
        "Department": "ISE",
        "Description": "Advanced data structures is a core course in Computer Science which most graduate program in Computer Science, Computer Science and Engineering, and other allied engineering disciplines, offer during the first year or first semester of the curriculum. The objective of this course is to enable students to have the much-needed foundation for advanced technical skill, leading to better problem-solving in their respective disciplines. Although the course is running in almost all the technical universities for decades, major changes in the syllabus have been observed due to the recent paradigm shift of computation which is more focused on huge data and internet-based technologies. Majority of the institute has been redefined their course content of advanced data structure to fit the current need and course material heavily relies on research papers because of nonavailability of the redefined text book advanced data structure. To the best of our knowledge well-known textbook on advanced data structure provides only partial coverage of the syllabus.\n \nThe book offers comprehensive coverage of the most essential topics, including:\nPart I details advancements on basic data structures, viz., cuckoo hashing, skip list, tango tree and Fibonacci heaps and index files.\nPart II details data structures of different evolving data domains like special data structures, temporal data structures, external memory data structures, distributed and streaming data structures.\nPart III elucidates the applications of these data structures on different areas of computer science viz, network, www, DBMS, cryptography, graphics to name a few. The concepts and techniques behind each data structure and their applications have been explained.\nEvery chapter includes a variety of Illustrative Problems pertaining to the data structure(s) detailed, a summary of the technical content of the chapter and a list of Review Questions, to reinforce the comprehension of the concepts.\nThe book could be used both as an introductory or an advanced-level textbook for the advanced undergraduate, graduate and research programmes which offer advanced data structures as a core or an elective course. While the book is primarily meant to serve as a course material for use in the classroom, it could be used as a starting point for the beginner researcher of a specific domain.",
        "InStock": true,
        "Name": "Advanced Data Structures: Theory and Applications",
        "Stock": 21,
        "Year": 2,
        "_id": "1138592609"
    },
    {
        "Author": "John Arundel ,  Justin Domingus",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/89/9d/6a/899d6a6976affcc6de962d140350436b.jpg",
        "Department": "CSE",
        "Description": "Kubernetes is the operating system of the cloud-native world, providing a reliable and scalable platform for running containerized workloads. This book shows developers and operations staff how to apply industry-standard DevOps practices to Kubernetes in a cloud-native context. You’ll learn all about the Kubernetes ecosystem and discover battle-tested solutions to everyday problems.\n\r\nIn this friendly, pragmatic book, cloud experts John Arundel and Justin Domingus show you what Kubernetes can do—and what you can do with it. You’ll build, step by step, an example cloud-native application and its supporting infrastructure, along with a development environment and continuous deployment pipeline that you can use for your own applications.\n\n\n\r\n• Understand containers and Kubernetes from first principles—no experience necessary\n\r\n• Run your own clusters or choose a managed Kubernetes service from Amazon, Google, and others\n\r\n• Design your own cloud-native services and infrastructure\n\r\n• Use Kubernetes to manage resource usage and the container lifecycle\n\r\n• Optimize clusters for cost, performance, resilience, capacity, and scalability\n\r\n• Learn the best tools for developing, testing, and deploying your applications\n\r\n• Apply the latest industry practices for observability and monitoring\n\r\n• Secure your containers and clusters in production\n\r\n• Adopt DevOps principles to help make your development teams lean, fast, and effective",
        "InStock": false,
        "Name": "Cloud Native DevOps with Kubernetes",
        "Stock": 0,
        "Year": 4,
        "_id": "1492040762"
    },
    {
        "Author": "Lixiang Yang",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d2/39/76/d23976f913ae0a19ff94173bbd642123.jpg",
        "Department": "ISE",
        "Description": "Difficulty in understanding an operating system (OS) lies not in the technical aspects, but in the complex relationships inside the operating systems. The Art of Linux Kernel Design: Illustrating the Operating System Design Principle and Implementation addresses this complexity. Written from the perspective of the designer of an operating system, this book tackles important issues and practical problems on how to understand an operating system completely and systematically. It removes the mystery, revealing operating system design guidelines, explaining the BIOS code directly related to the operating system, and simplifying the relationships and guiding ideology behind it all.\nBased on the Source Code of a Real Multi-Process Operating System\nUsing the 0.11 edition source code as a representation of the Linux basic design, the book illustrates the real states of an operating system in actual operations. It provides a complete, systematic analysis of the operating system source code, as well as a direct and complete understanding of the real operating system run-time structure. The author includes run-time memory structure diagrams, and an accompanying essay to help readers grasp the dynamics behind Linux and similar software systems.",
        "InStock": true,
        "Name": "The Art of Linux Kernel Design: Illustrating the Operating System Design Principle and Implementation",
        "Stock": 4,
        "Year": 3,
        "_id": "978-1-4665-1803-2"
    },
    {
        "Author": "Tsuneyoshi Nakayama ,  Hiroyuki Shima (auth.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1a/4f/38/1a4f388e32af10b01107abfa07eb01fa.jpg",
        "Department": "Math",
        "Description": "Due to the rapid expansion of the frontiers of physics and engineering, the demand for higher-level mathematics is increasing yearly. This book is designed to provide accessible knowledge of higher-level mathematics demanded in contemporary physics and engineering. Rigorous mathematical structures of important subjects in these fields are fully covered, which will be helpful for readers to become acquainted with certain abstract mathematical concepts. The selected topics are:\n- Real analysis, Complex analysis, Functional analysis, Lebesgue integration theory, Fourier analysis, Laplace analysis, Wavelet analysis, Differential equations, and Tensor analysis.\nThis book is essentially self-contained, and assumes only standard undergraduate preparation such as elementary calculus and linear algebra. It is thus well suited for graduate students in physics and engineering who are interested in theoretical backgrounds of their own fields. Further, it will also be useful for mathematics students who want to understand how certain abstract concepts in mathematics are applied in a practical situation. The readers will not only acquire basic knowledge toward higher-level mathematics, but also imbibe mathematical skills necessary for contemporary studies of their own fields.",
        "InStock": false,
        "Name": "Higher Mathematics for Physics and Engineering: Mathematical Methods for Contemporary Physics",
        "Stock": 0,
        "Year": 1,
        "_id": "3540878637"
    },
    {
        "Author": "Grewal B. S.",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/75/30/72/753072ea7a0a4404c0c70587330b28ab.jpg",
        "Department": "Math",
        "Description": "The book provides a clear exposition of essential tools of applied mathematics from a modern point of view and meets complete requirements of engineering and computer science students. Every effort has been made to keep the presentation at once simple and lucid. It is written with the firm conviction that a good book is one that can be read with minimum guidance from the instructor. To achieve this, more than the usual number of solved examples, followed by properly graded problems have been given. Many of the examples and problems have been selected from recent papers of various university and other engineering examinations. Basic Concepts and Useful Information has been given in an Appendix.\n- Algebra & Geometry: Solution of equations, Linear algebra: Determinants, Matrices, Vector algebra and Solid geometry.\n- Calculus: Differential calculus, Partial differentiation, Integral calculus, Multiple integrals, Vector calculus.\n- Series: Infinite Series and Fourier Series.\n- Differential Equations: Differential equations of first order and their applications, Linear differential equations and their applications, Differential equations of different types, Series solution of differential equations and special functions, Partial differential equations and their applications.\n- Complex Analysisc: Complex numbers and functions, Calculus of complex functions.\n- Transforms: Laplace Transforms, Fourier transforms and Z-transforms.\n- Numerical Techniques: Empirical Laws and Curve fitting, Statistical methods, Probability and Distributions, Sampling and Inference, Numerical methods, Finite differences and Interpolation, Difference equations, Numerical solution of Ordinary and Partial differential equations, Linear programming.\n- Special Topics: Calculus of variations, Integral equations, Discrete mathematics, Tensors.\nAn exhaustive list of Objective Type of Questions has been given at the end of each chapter. Standard Tables, Answers to Problems, and a fairly comprehensive Index is given at the end.",
        "InStock": true,
        "Name": "Higher engineering mathematics",
        "Stock": 15,
        "Year": 2,
        "_id": "978-81-7409-195-5"
    },
    {
        "Author": "Stephen Brown ,  Zvonko Vranesic",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/70/84/60/7084609a715d3c56a468c66d66dd1019.jpg",
        "Department": "ECE",
        "Description": "Fundamentals of Digital Logic With Verilog Design is intended for an introductory course in digital logic design. The main goals are (1) to teach students the fundamental concepts in classical manual digital design, and (2) illlustrate clearly the way in which digital circuits are designed today, using CAD tools.Use of CAD software is well integrated into the book. Some excellent CAD tools are available free of charge. For example, the Altera Corporation has its Quartus II CAD software, used for implementing designs in programmable logic devices such as FPGAs.\nThe Web Edition of the Quartus II software can be downloaded from Alteras website and used free of charge, without the need to obtain a license. Previous editions of this book a set of tutorials for using Quartus II software was provided in the appendices. These tutorials can now be found on the Authors website. Another set of useful tutorials about Quartus II can be found on Alteras University Program website, which is located at www.altera.com/education/univ",
        "InStock": false,
        "Name": "Fundamentals of Digital Logic with Verilog Design",
        "Stock": 0,
        "Year": 3,
        "_id": "0073380547"
    },
    {
        "Author": "John L. Hennessy ,  David A. Patterson",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/58/73/4d/58734dae75228cd8ccf1be995da2893a.jpg",
        "Department": "CSE",
        "Description": "Computer Architecture: A Quantitative Approach, Sixth Edition\n has been considered essential reading by instructors, students and practitioners of computer design for over 20 years. The sixth edition of this classic textbook is fully revised with the latest developments in processor and system architecture. It now features examples from the RISC-V (RISC Five) instruction set architecture, a modern RISC instruction set developed and designed to be a free and openly adoptable standard. It also includes a new chapter on domain-specific architectures and an updated chapter on warehouse-scale computing that features the first public information on Google's newest WSC. \n \nTrue to its original mission of demystifying computer architecture, this edition continues the longstanding tradition of focusing on areas where the most exciting computing innovation is happening, while always keeping an emphasis on good engineering design.\nIncludes a new chapter on domain-specific architectures, explaining how they are the only path forward for improved performance and energy efficiency given the end of Moore’s Law and Dennard scaling\nFeatures the first publication of several DSAs from industry \nFeatures extensive updates to the chapter on warehouse-scale computing, with the first public information on the newest Google WSC \nOffers updates to other chapters including new material dealing with the use of stacked DRAM; data on the performance of new NVIDIA Pascal GPU vs. new AVX-512 Intel Skylake CPU; and extensive additions to content covering multicore architecture and organization\nIncludes \"Putting It All Together\" sections near the end of every chapter, providing real-world technology examples that demonstrate the principles covered in each chapter \nIncludes review appendices in the printed text and additional reference appendices available online \nIncludes updated and improved case studies and exercises",
        "InStock": false,
        "Name": "Computer Architecture, Sixth Edition: A Quantitative Approach",
        "Stock": 0,
        "Year": 2,
        "_id": "0128119055"
    },
    {
        "Author": "Simone Cirani ,  Gianluigi Ferrari ,  Marco Picone ,  Luca Veltri",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/17/0d/fb/170dfb87dba9a9da17c235587762b132.jpg",
        "Department": "ISE",
        "Description": "This book addresses researchers and graduate students at the forefront of study/research on the Internet of Things (IoT) by presenting state-of-the-art research together with the current and future challenges in building new smart applications (e.g., Smart Cities, Smart Buildings, and Industrial IoT) in an efficient, scalable, and sustainable way. It covers the main pillars of the IoT world (Connectivity, Interoperability, Discoverability, and Security/Privacy), providing a comprehensive look at the current technologies, procedures, and architectures.",
        "InStock": true,
        "Name": "Internet of Things: Architectures, Protocols and Standards",
        "Stock": 13,
        "Year": 3,
        "_id": "1119359708"
    },
    {
        "Author": "William Stallings",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/23/f3/13/23f31322bee8afe15949d3ba83be62c9.jpg",
        "Department": "CSE",
        "Description": "Four-time winner of the best Computer Science and Engineering textbook of the year award from the Textbook and Academic Authors Association, Computer Organization and Architecture: Designing for Performance provides a thorough discussion of the fundamentals of computer organization and architecture, covering not just processor design, but memory, I/O, and parallel systems. Coverage is supported by a wealth of concrete examples emphasizing modern RISC, CISC, and superscalar systems. Undergraduates and professionals in computer science, computer engineering, and electrical engineering courses will learn the fundamentals of processor and computer design from this award-winning text.   The eighth revision has been updated to reflect major advances in computer technology, including multicore processors and embedded processors. Interactive simulations have been expanded and keyed into relevant sections of text.",
        "InStock": true,
        "Name": "Computer Organization and Architecture Designing for Performance 10th Edition",
        "Stock": 28,
        "Year": 2,
        "_id": "0134101618"
    },
    {
        "Author": "W. D. Wallis",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/24/b7/ce/24b7cefe0416b5afbe3c8dede783dc1e.jpg",
        "Department": "Math",
        "Description": "Wallis's book on discrete mathematics is a resource for an introductory course in a subject fundamental to both mathematics and computer science, a course that is expected not only to cover certain specific topics but also to introduce students to important modes of thought specific to each discipline . . . Lower-division undergraduates through graduate students. —Choice reviews (Review of the First Edition)\nThis second edition of \nA Beginner’s Guide to Discrete Mathematics\n presents a detailed guide to discrete mathematics and its relationship to other mathematical subjects including set theory, probability, cryptography, graph theory, and number theory. This textbook has a distinctly applied orientation and explores a variety of applications.\nKey Features of the second edition: * Includes a new chapter on the theory of voting as well as numerous new examples and exercises throughout the book * Introduces functions, vectors, matrices, number systems, scientific notations, and the representation of numbers in computers * Provides examples which then lead into easy practice problems throughout the text and full exercise at the end of each chapter * Full solutions for practice problems are provided at the end of the book\nThis text is intended for undergraduates in mathematics and computer science, however, featured special topics and applications may also interest graduate students.",
        "InStock": true,
        "Name": "A Beginner's Guide to Discrete Mathematics",
        "Stock": 5,
        "Year": 2,
        "_id": "0817682856"
    },
    {
        "Author": "Harry Lewis ,  Rachel Zax",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/e5/e4/e4/e5e4e4a7cd1ab4a7a46d5921252bc70f.jpg",
        "Department": "Math",
        "Description": "A more intuitive approach to the mathematical foundation of computer science\n\r\nDiscrete mathematics is the basis of much of computer science, from algorithms and automata theory to combinatorics and graph theory. This textbook covers the discrete mathematics that every computer science student needs to learn. Guiding students quickly through thirty-one short chapters that discuss one major topic each, this flexible book can be tailored to fit the syllabi for a variety of courses.\n\r\nProven in the classroom, Essential Discrete Mathematics for Computer Science aims to teach mathematical reasoning as well as concepts and skills by stressing the art of proof. It is fully illustrated in color, and each chapter includes a concise summary as well as a set of exercises. The text requires only precalculus, and where calculus is needed, a quick summary of the basic facts is provided.\n\r\nEssential Discrete Mathematics for Computer Science is the ideal introductory textbook for standard undergraduate courses, and is also suitable for high school courses, distance education for adult learners, and self-study.\n\n\n\r\n• The essential introduction to discrete mathematics\n\r\n• Features thirty-one short chapters, each suitable for a single class lesson\n\r\n• Includes more than 300 exercises\n\r\n• Almost every formula and theorem proved in full\n\r\n• Breadth of content makes the book adaptable to a variety of courses\n\r\n• Each chapter includes a concise summary\n\r\n• Solutions manual available to instructors",
        "InStock": false,
        "Name": "Essential Discrete Mathematics for Computer Science",
        "Stock": 0,
        "Year": 2,
        "_id": "0691179298"
    },
    {
        "Author": "Michael Kerrisk",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/81/2f/a9/812fa92405f19d7333cfbdccd53d724b.jpg",
        "Department": "CSE",
        "Description": "The Linux Programming Interface is the definitive guide to the Linux and UNIX programming interface—the interface employed by nearly every application that runs on a Linux or UNIX system.\n\r\nIn this authoritative work, Linux programming expert Michael Kerrisk provides detailed descriptions of the system calls and library functions that you need in order to master the craft of system programming, and accompanies his explanations with clear, complete example programs.\n\r\nYou'll find descriptions of over 500 system calls and library functions, and more than 200 example programs, 88 tables, and 115 diagrams. You'll learn how to:\n\r\n• Read and write files efficiently\n\r\n• Use signals, clocks, and timers\n\r\n• Create processes and execute programs\n\r\n• Write secure programs\n\r\n• Write multithreaded programs using POSIX threads\n\r\n• Build and use shared libraries\n\r\n• Perform interprocess communication using pipes, message queues, shared memory, and semaphores\n\r\n• Write network applications with the sockets API\n\r\nWhile The Linux Programming Interface covers a wealth of Linux-specific features, including epoll, inotify, and the /proc file system, its emphasis on UNIX standards (POSIX.1-2001/SUSv3 and POSIX.1-2008/SUSv4) makes it equally valuable to programmers working on other UNIX platforms.\n\r\nThe Linux Programming Interface is the most comprehensive single-volume work on the Linux and UNIX programming interface, and a book that's destined to become a new classic.",
        "InStock": true,
        "Name": "The Linux programming interface: a Linux and UNIX system programming handbook",
        "Stock": 17,
        "Year": 2,
        "_id": "1593272200"
    },
    {
        "Author": "Cameron Newham",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/2c/0e/1c/2c0e1c0d544553e744e8bd2cb97b930e.jpg",
        "Department": "CSE",
        "Description": "O'Reilly's bestselling book on Linux's bash shell is at it again.  Now that Linux is an established player both as a server and on the desktop  Learning the bash Shell  has been updated and refreshed to account for all the latest changes.  Indeed, this third edition serves as the most valuable guide yet to the bash shell. \n \nAs any good programmer knows, the first thing users of the Linux operating system come face to face with is the shell the UNIX term for a user interface to the system.  In other words, it's what lets you communicate with the computer via the keyboard and display.  Mastering the bash shell might sound fairly simple but it isn't.  In truth, there are many complexities that need careful explanation, which is just what  Learning the bash Shell  provides.\n \nIf you are new to shell programming, the book provides an excellent introduction, covering everything from the most basic to the most advanced features.  And if you've been writing shell scripts for years, it offers a great way to find out what the new shell offers.   Learning the bash Shell  is also full of practical examples of shell commands and programs that will make everyday use of Linux that much easier.  With this book, programmers will learn: \nHow to install bash as your login shell\n \nThe basics of interactive shell use, including UNIX file and directory structures, standard I/O, and background jobs\n \nCommand line editing, history substitution, and key bindings\nHow to customize your shell environment without programming\nThe nuts and bolts of basic shell programming, flow control structures, command-line options and typed variables\nProcess handling, from job control to processes, coroutines and subshells\nDebugging techniques, such as trace and verbose modes\nTechniques for implementing system-wide shell customization and features related to system security",
        "InStock": true,
        "Name": "Learning the bash Shell: Unix Shell Programming",
        "Stock": 24,
        "Year": 2,
        "_id": "0596009658"
    },
    {
        "Author": "W. Richard Stevens ,  Stephen A. Rago",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/3d/36/f3/3d36f36543de28ad0d5c7683a965fd8a.jpg",
        "Department": "ISE",
        "Description": "For more than twenty years, serious C programmers have relied on one book for practical, in-depth knowledge of the programming interfaces that drive the UNIX and Linux kernels: W. Richard Stevens’ Advanced Programming in the UNIX® Environment . Now, once again, Rich’s colleague Steve Rago has thoroughly updated this classic work. The new third edition supports today’s leading platforms, reflects new technical advances and best practices, and aligns with Version 4 of the Single UNIX Specification.\nSteve carefully retains the spirit and approach that have made this book so valuable. Building on Rich’s pioneering work, he begins with files, directories, and processes, carefully laying the groundwork for more advanced techniques, such as signal handling and terminal I/O. He also thoroughly covers threads and multithreaded programming, and socket-based IPC.\nThis edition covers more than seventy new interfaces, including POSIX asynchronous I/O, spin locks, barriers, and POSIX semaphores. Most obsolete interfaces have been removed, except for a few that are ubiquitous. Nearly all examples have been tested on four modern platforms: Solaris 10, Mac OS X version 10.6.8 (Darwin 10.8.0), FreeBSD 8.0, and Ubuntu version 12.04 (based on Linux 3.2).\nAs in previous editions, you’ll learn through examples, including more than ten thousand lines of downloadable, ISO C source code. More than four hundred system calls and functions are demonstrated with concise, complete programs that clearly illustrate their usage, arguments, and return values. To tie together what you’ve learned, the book presents several chapter-length case studies, each reflecting contemporary environments.\nAdvanced Programming in the UNIX® Environment has helped generations of programmers write code with exceptional power, performance, and reliability. Now updated for today’s systems, this third edition will be even more valuable.",
        "InStock": false,
        "Name": "Advanced Programming in the UNIX Environment",
        "Stock": 0,
        "Year": 2,
        "_id": "0321637739"
    },
    {
        "Author": "Thomas H. Cormen ,  Charles E. Leiserson ,  Ronald L. Rivest ,  Clifford Stein",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/23/6a/1a/236a1aa3905bd94d9163eb87c84a93dc.jpg",
        "Department": "CSE",
        "Description": "Some books on algorithms are rigorous but incomplete; others cover masses of material but lack rigor. Introduction to Algorithms uniquely combines rigor and comprehensiveness. The book covers a broad range of algorithms in depth, yet makes their design and analysis accessible to all levels of readers. Each chapter is relatively self-contained and can be used as a unit of study. The algorithms are described in English and in a pseudocode designed to be readable by anyone who has done a little programming. The explanations have been kept elementary without sacrificing depth of coverage or mathematical rigor.\n\r\nThe first edition became a widely used text in universities worldwide as well as the standard reference for professionals. The second edition featured new chapters on the role of algorithms, probabilistic analysis and randomized algorithms, and linear programming. The third edition has been revised and updated throughout. It includes two completely new chapters, on van Emde Boas trees and multithreaded algorithms, substantial additions to the chapter on recurrence (now called “Divide-and-Conquer”), and an appendix on matrices. It features improved treatment of dynamic programming and greedy algorithms and a new notion of edge-based flow in the material on flow networks. Many new exercises and problems have been added for this edition. As of the third edition, this textbook is published exclusively by the MIT Press.",
        "InStock": false,
        "Name": "Introduction to algorithms",
        "Stock": 0,
        "Year": 2,
        "_id": "0262533057"
    },
    {
        "Author": "Jean-Philippe Ansermet ,  Sylvain D. Brechet",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/29/8d/5b/298d5b793e8e4ea777c283a683438cb2.jpg",
        "Department": "Physics",
        "Description": "In this introductory textbook, thermodynamics is presented as a natural extension of mechanics, so that the laws and concepts learned in mechanics serve to get acquainted with the theory. The foundations of thermodynamics are presented in the first part. The second part covers a wide range of applications, which are of central importance in the fields of physics, chemistry and engineering, including calorimetry, phase transitions, heat engines and chemical reactions. In the third part, devoted to continuous media, Fourier and Fick's laws, diffusion equations and many transport effects are derived using a unified approach. Each chapter concludes with a selection of worked examples and several exercises, to reinforce key concepts under discussion. A full solutions manual is available at the end of the book. It contains more than 150 problems based on contemporary issues faced by scientists and engineers that are solved in detail for undergraduate and graduate students.",
        "InStock": true,
        "Name": "Principles of Thermodynamics",
        "Stock": 6,
        "Year": 2,
        "_id": "978-1-108-42609-1"
    },
    {
        "Author": "Yunus A. Çengel ,  Michael A. Boles",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/6a/4e/d7/6a4ed73ae00d3eef0b078cfb696c02e2.jpg",
        "Department": "Mechanical",
        "Description": "Thermodynamics, An Engineering Approach, eighth edition, covers the basic principles of thermodynamics while presenting a wealth of real-world engineering examples so students get a feel for how thermodynamics is applied in engineering practice. This text helps students develop an intuitive understanding by emphasizing the physics and physical arguments. Cengel and Boles explore the various facets of thermodynamics through careful explanations of concepts and use of numerous practical examples and figures, having students develop necessary skills to bridge the gap between knowledge and the confidence to properly apply their knowledge.\n \nMcGraw-Hill is proud to offer Connect with the eighth edition of Cengel/Boles, Thermodynamics, An Engineering Approach. Connect is the only integrated learning system that empowers students by continuously adapting to deliver precisely what they need, when they need it, how they need it, so that your class time is more engaging and effective. Problems are graded automatically, and the results are recorded immediately. Track individual student performance - by question, assignment, or in relation to the class overall with detailed grade reports.",
        "InStock": true,
        "Name": "Thermodynamics: An Engineering Approach 8th Edition",
        "Stock": 2,
        "Year": 2,
        "_id": "0073398179"
    },
    {
        "Author": "R. Shankar",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/15/6a/b5/156ab54bbccd168e8512054b3d5f2bfb.jpg",
        "Department": "Phyics",
        "Description": "Professor R. Shankar, a well-known physicist and contagiously enthusiastic educator, was among the first to offer a course through the innovative Open Yale Course program. His popular online video lectures on introductory physics have been viewed over a million times. In this concise and self-contained book based on his online Yale course, Shankar explains the fundamental concepts of physics from Galileo’s and Newton’s discoveries to the twentieth-century’s revolutionary ideas on relativity and quantum mechanics.\n  \n The book begins at the simplest level, develops the basics, and reinforces fundamentals, ensuring a solid foundation in the principles and methods of physics. It provides an ideal introduction for college-level students of physics, chemistry, and engineering, for motivated AP Physics students, and for general readers interested in advances in the sciences.\n Instructor resources--including problem sets and sample examinations--and more information about Professor Shankar's course are available at http://oyc.yale.edu/physics/phys-200.",
        "InStock": true,
        "Name": "Fundamentals of Physics: Mechanics, Relativity, and Thermodynamics",
        "Stock": 14,
        "Year": 2,
        "_id": "0300192207"
    },
    {
        "Author": "David McMahon",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/28/fd/98/28fd9842444a70e22656719cfd84cf1d.jpg",
        "Department": "CSE",
        "Description": "A self-contained treatment of the fundamentals of quantum computing          This clear, practical book takes quantum computing out of the realm of theoretical physics and teaches the fundamentals of the field to students and professionals who have not had training in quantum computing or quantum information theory, including computer scientists, programmers, electrical engineers, mathematicians, physics students, and chemists. The author cuts through the conventions of typical jargon-laden physics books and instead presents the material through his unique \"how-to\" approach and friendly, conversational style.          Readers will learn how to carry out calculations with explicit details and will gain a fundamental grasp of:     *          Quantum mechanics     *          Quantum computation     *          Teleportation     *          Quantum cryptography     *          Entanglement     *          Quantum algorithms     *          Error correction          A number of worked examples are included so readers can see how quantum computing is done with their own eyes, while answers to similar end-of-chapter problems are provided for readers to check their own work as they learn to master the information.          Ideal for professionals and graduate-level students alike, Quantum Computing Explained delivers the fundamentals of quantum computing readers need to be able to understand current research papers and go on to study more advanced quantum texts.",
        "InStock": true,
        "Name": "Quantum Computing Explained",
        "Stock": 8,
        "Year": 4,
        "_id": "0470096993"
    },
    {
        "Author": "William Bolton",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/00/6f/b5/006fb52325cf1242508846ff0bb3490e.jpg",
        "Department": "Mechanical",
        "Description": "The integration of electronic engineering, mechanical engineering, control and computer engineering - Mechatronics - lies at the heart of the innumerable gadgets, processes and technology without which modern life would seem impossible. From auto-focus cameras to car engine management systems, and from state-of-the-art robots to the humble washing machine, Mechatronics has a hand in them all.\nThis book presents a clear and comprehensive introduction to the area. Practical and applied, it helps you to acquire the mix of skills you will need to comprehend and design mechatronic systems. It also goes much deeper, explaining the very philosophy of mechatronics, and, in so doing, provides you with a frame of understanding to develop a truly interdisciplinary and integrated approach to engineering.\nNew to this edition:\n• Inclusion of material on the Arduino open-source electronic prototyping platform and the Arduino programming language\n• Even more mechatronic systems topics\n• New section on robotic systems\n• Updated resources for instructors available at www.pearsoned.co.uk/Bolton\nMechatronics\n is essential reading for students requiring an introduction to this exciting area at undergraduate and higher diploma level. \nBill Bolton\n was formerly Consultant to the Further Education Unit and Head of Research and Development and Monitoring at the Business and Technology Education Council (BTEC). He has also been a UNESCO consultant and is the author of many successful engineering textbooks.",
        "InStock": false,
        "Name": "Mechatronics: Electronic Control Systems in Mechanical and Electrical Engineering, 6th Edition",
        "Stock": 0,
        "Year": 2,
        "_id": "9781292081595"
    },
    {
        "Author": "John J. Uicker ,  Jr. ,  Gordon R. Pennock ,  Joseph E. Shigley",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/35/8e/ba/358eba584144e4706a57f36fb7c65fa6.jpg",
        "Department": "IPE",
        "Description": "Theory of Machines and Mechanisms,\n Fifth Edition, is an ideal text for the complete study of displacements, velocities, accelerations, and static and dynamic forces required for the proper design of mechanical linkages, cams, and geared systems. The authors present the background, notation, and nomenclature essential for students to understand the various independent technical approaches that exist in the field of mechanisms, kinematics, and dynamics. The fifth edition features streamlined coverage and substantially revised worked examples. This latest edition also includes a greater number of problems, suitable for in-class discussion or homework, at the end of each chapter.\nFEATURES\n* Offers balanced coverage of all topics by both graphic and analytic methods\n* Covers all major analytic approaches\n* Provides high-accuracy graphical solutions to exercises, by use of CAD software\n* Includes the method of kinematic coefficients and also integrates the coverage of linkages, cams, and geared systems\n* An Ancillary Resource Center (ARC) offers an Instructor's Solutions Manual, solutions to 100 of the problems from the text using MatLab, and PowerPoint lecture slides\n* A Companion Website includes more than 100 animations of key figures from the text",
        "InStock": true,
        "Name": "Theory of Machines and Mechanisms",
        "Stock": 26,
        "Year": 2,
        "_id": "9780190264482"
    },
    {
        "Author": "Robert L. Mott ,  Edward M. Vavrek ,  Jyhwen Wang",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/3b/e5/91/3be591092f39d20f7f6a1ecfef90a6ca.jpg",
        "Department": "Mechanical",
        "Description": "Using the most up-to-date information, this book provides a practical approach to designing machine elements in the context of complete mechanical design.Covering some of the primary machine elements such as belt drives, chain drives, gears, shafts, keys, couplings, seals, and rolling contact bearings. It also covers plain surface bearings, linear motion elements, fasteners, springs, machine frames, bolted connections, welded joints, electric motors, controls, clutches, and brakes.This book is for any individual design professional for which a practical approach to mechanical design, based on sound engineering principles, is desired.",
        "InStock": true,
        "Name": "Machine Elements in Mechanical Design",
        "Stock": 6,
        "Year": 3,
        "_id": "978-0134441184"
    },
    {
        "Author": "H. J. Pain",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/ac/06/e0/ac06e0ff962f3662ec5743725248015a.jpg",
        "Department": "Physics",
        "Description": "The main theme of this highly successful book is that the transmission of energy by wave propogation is fundamental to almost every branch of physics. Therefore, besides giving students a thorough grounding in the theory of waves and vibrations, the book also demonstrates the pattern and unity of a large part of physics.     This new edition has been thoroughly revised and has been redeisgned to meet the best contemporary standards. It includes new material on electron waves in solids using the Kronig-Penney model to show how their allowed energies are limited to Brillouin zones, The role of phonons is also discussed. An Optical Transform is used to demonstrate the modern method of lens testing. In the last two chapters the sections on chaos and solitons have been reduced but their essential contents remain.     As with earlier editions, the book has a large number of problems together with hints on how to solve them. The Physics of Vibrations and Waves, 6th Edition will prove invaluable for students taking a first full course in the subject across a variety of disciplines particularly physics, engineering and mathematics.",
        "InStock": true,
        "Name": "The Physics of Vibrations and Waves",
        "Stock": 10,
        "Year": 1,
        "_id": "0470016957"
    },
    {
        "Author": "Richard P. Feynman ,  Robert B. Leighton ,  Matthew Sands",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/0e/54/ad/0e54ad7d7db6bb43c5ada4a16bb7528d.jpg",
        "Department": "Phyics",
        "Description": "The whole thing was basically an experiment,” Richard Feynman said late in his career, looking back on the origins of his lectures. The experiment turned out to be hugely successful, spawning publications that have remained definitive and introductory to physics for decades. Ranging from the basic principles of Newtonian physics through such formidable theories as general relativity and quantum mechanics, Feynman’s lectures stand as a monument of clear exposition and deep insight.\n Timeless and collectible, the lectures are essential reading, not just for students of physics but for anyone seeking an introduction to the field from the inimitable Feynman.",
        "InStock": true,
        "Name": "The Feynman Lectures on Physics, Vol. I: The New Millennium Edition: Mainly Mechanics, Radiation, and Heat",
        "Stock": 7,
        "Year": 1,
        "_id": "0465025625"
    },
    {
        "Author": "Subramanian ,  R",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/a3/c4/33/a3c4333cdb91cf6bce0afe7bdec62e6d.jpg",
        "Department": "Mechanical",
        "Description": "Beginning with an introduction to the basic concepts of stresses in simple and composite elements, strains, and deformation of solids, the book moves through discussions on loads and stresses on the beam, which is a common structural element, torsion, and beam deflection. It then discusses columns and analysis of stresses in two dimensions. the boko also deals with strain energy concepts and their applications. \nThe book provides an exhaustive coverage of important topics such as temperature stresses. elastic constants, bending moments, shear forces, theory of simple bending, analysis and design of shafts, stepped, indeterminate and compound shafts, close- and open-coiled helical springs, Euler equations and Rankine formula for columns, and Mohr's circle. \nTO reinforce the theoretical concepts, the text is supplemented by a large number of worked-out examples with step-by-step solution procedures as well as a large number of review questions and exercise problems. The text is also well supported by a large number of detailed illustrations.",
        "InStock": true,
        "Name": "Strength of materials",
        "Stock": 25,
        "Year": 3,
        "_id": "211-213-217-2"
    },
    {
        "Author": "Myer Kutz",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7b/47/ce/7b47ce3933e7a37651268d1b008e4e49.jpg",
        "Department": "Mechanical",
        "Description": "Full coverage of materials and mechanical design in engineering\n \nMechanical Engineers' Handbook, Fourth Edition\n provides a quick guide to specialized areas you may encounter in your work, giving you access to the basics of each and pointing you toward trusted resources for further reading, if needed. The accessible information inside offers discussions, examples, and analyses of the topics covered.\n \nThis first volume covers materials and mechanical design, giving you accessible and in-depth access to the most common topics you'll encounter in the discipline: carbon and alloy steels, stainless steels, aluminum alloys, copper and copper alloys, titanium alloys for design, nickel and its alloys, magnesium and its alloys, superalloys for design, composite materials, smart materials, electronic materials, viscosity measurement, and much more.\n \n \nPresents comprehensive coverage of materials and mechanical design\n \nOffers the option of being purchased as a four-book set or as single books, depending on your needs\n \nComes in a subscription format through the Wiley Online Library and in electronic and custom formats\n \n \nEngineers at all levels of industry, government, or private consulting practice will find \nMechanical Engineers' Handbook, Volume 1\n a great resource they'll turn to repeatedly as a reference on the basics of materials and mechanical design.",
        "InStock": true,
        "Name": "Materials and Engineering Mechanics",
        "Stock": 10,
        "Year": 2,
        "_id": "1118112822"
    },
    {
        "Author": "Cem Unsalan ,  Bora Tar",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/55/c2/f4/55c2f4958aa20f7d72bd33d1521ed7e2.jpg",
        "Department": "ECE",
        "Description": "Master FPGA digital system design and implementation with Verilog and VHDL\nThis practical guide explores the development and deployment of FPGA-based digital systems using the two most popular hardware description languages, Verilog and VHDL. Written by a pair of digital circuit design experts, the book offers a solid grounding in FPGA principles, practices, and applications and provides an overview of more complex topics. Important concepts are demonstrated through real-world examples, ready-to-run code, and inexpensive start-to-finish projects for both the Basys and Arty boards.\nDigital System Design with FPGA: Implementation Using Verilog and VHDL covers:\n• Field programmable gate array fundamentals\n• Basys and Arty FPGA boards\n• The Vivado design suite\n• Verilog and VHDL\n• Data types and operators\n• Combinational circuits and circuit blocks\n• Data storage elements and sequential circuits\n• Soft-core microcontroller and digital interfacing\n• Advanced FPGA applications\n• The future of FPGA\n“I joined Xilinx five years ago and have looked for a good, introductory book on FPGA-based design ever since because people have repeatedly asked me for my recommendation. Today, I found a brand new book to recommend to people wanting to learn about using programmable logic to design digital systems. It’s titled ― \nDigital Systems Design with FPGA: Implementation Using Verilog and VHDL\n and…[it] will take you from the basics of digital design and logic into FPGAs; FPGA architecture including programmable logic, block RAM, DSP slices, FPGA clock management, and programmable I/O; hardware description languages with an equal emphasis on Verilog and VHDL; the Xilinx Vivado Design Environment; and then on to IP cores including the Xilinx MicroBlaze and PicoBlaze soft processors. The book ends with 24 advanced embedded design projects.” – Steve Leibson, Xcell Daily Blog",
        "InStock": true,
        "Name": "Digital System Design with FPGA: Implementation Using Verilog and VHDL",
        "Stock": 5,
        "Year": 2,
        "_id": "1259837904"
    },
    {
        "Author": "Charles Roth ,  Lizy K. John ,  Byeong Kil Lee",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/22/29/f4/2229f47f1c8a225696f575eeda0b5336.jpg",
        "Department": "ECE",
        "Description": "Master the process of designing and testing new hardware configurations with DIGITAL SYSTEMS DESIGN USING VERILOG. This practical book integrates coverage of logic design principles, Verilog as a hardware design language, and FPGA implementation. The authors present Verilog constructs side-by-side with hardware, encouraging you to think in terms of desired hardware while writing synthesizable Verilog. Following a review of the basic concepts of logic design, the authors introduce the basics of Verilog using simple combinational circuit examples, followed by models for simple sequential circuits. Subsequent chapters ask you to tackle more and more complex designs.",
        "InStock": false,
        "Name": "Digital Systems Design Using Verilog",
        "Stock": 0,
        "Year": 2,
        "_id": "1285051076"
    },
    {
        "Author": "Behzad Razavi",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/09/62/c8/0962c8cc4d161f30dd87f0a8b0069391.jpg",
        "Department": "ECE",
        "Description": "The second edition of Design of Analog CMOS Integrated Circuits by Behzad Razavi, deals with the analysis and design of analog CMOS integrated circuits, emphasizing fundamentals as well as new paradigms that students and practicing engineers need to master in today's industry. Since analog design requires both intuition and rigor, each concept is first introduced from an intuitive perspective and subsequently treated by careful analysis. The objective is to develop both a solid foundation and methods of analyzing circuits by inspection so that the reader learns what approximations can be made in which circuits and how much error to expect in each approximation. This approach also enables the reader to apply the concepts to bipolar circuits with little additional effort.",
        "InStock": true,
        "Name": "Design of Analog CMOS Integrated Circuits",
        "Stock": 6,
        "Year": 3,
        "_id": "0072524936"
    },
    {
        "Author": "Neil H. E. Weste ,  David Money Harris",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/51/bd/9c/51bd9c7e9e62df12b1122c9b874dbfac.jpg",
        "Department": "ECE",
        "Description": "For both introductory and advanced courses in VLSI design, this authoritative, comprehensive textbook is highly accessible to beginners, yet offers unparalleled breadth and depth for more experienced readers.     The Fourth Edition of CMOS VLSI Design: A Circuits and Systems perspective presents broad and in-depth coverage of the entire field of modern CMOS VLSI Design. The authors draw upon extensive industry and classroom experience to introduce today’s most advanced and effective chip design practices. They present extensively updated coverage of every key element of VLSI design, and illuminate the latest design challenges with 65 nm process examples. This book contains unsurpassed circuit-level coverage, as well as a rich set of problems and worked examples that provide deep practical insight to readers at all levels.",
        "InStock": false,
        "Name": "CMOS VLSI Design: A Circuits and Systems Perspective (4th Edition)",
        "Stock": 0,
        "Year": 3,
        "_id": "0321547748"
    },
    {
        "Author": "R. Jacob  Baker",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/af/e3/1b/afe31be37189ec48df9c03753a05a51c.jpg",
        "Department": "ECE",
        "Description": "2007 Winner of the Frederick Emmons Terman Award      \n     CMOS: Circuit Design, Layout, and Simulation, Second Edition  covers the practical design of both analog and digital integrated circuits, offering a vital contemporary view of a wide range of analog/digital circuit blocks, the BSIM model, data converter architectures, and much more. This edition takes a two-path approach to the topics; design techniques are developed for both long- and short-channel CMOS technologies and then compared. The results are multidimensional explanations that allow readers deep insight into the design process.    \n    Features include:      \n \n Integrated-circuit layout software for Windows designed by David Boyce       \n Updated materials to reflect CMOS technology's movement into nanometer sizes       \n Discussions on phase- and delay-locked loops, mixed-signal circuits, data converters, and circuit noise       \n More than 1,000 figures, 200 examples, and over 500 end-of-chapter problems       \n In-depth coverage of both analog and digital circuit-level design techniques       \n Real-world process parameters and design rules       \n Associated Web site (cmosedu.com) provides examples, solutions, and SPICE simulation netlists      \n           An Instructor's Manual presenting detailed solutions to all the problems in the book is available upon request from the Wiley Makerting Department.",
        "InStock": false,
        "Name": "CMOS Circuit Design, Layout, and Simulation,",
        "Stock": 0,
        "Year": 3,
        "_id": "9780471700555"
    },
    {
        "Author": "Stroustrup B.",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/ab/06/e4/ab06e4fa3a7f054f145daab1d73e93fa.jpg",
        "Department": "ISE",
        "Description": "C++11 has arrived: thoroughly master it, with the definitive new guide from C++ creator Bjarne Stroustrup, \nC++ Programming Language, Fourth Edition!\n The brand-new edition of the world's most trusted and widely read guide to C++, it has been comprehensively updated for the long-awaited C++11 standard. Extensively rewritten to present the C++11 language, standard library, and key design techniques as an integrated whole, Stroustrup thoroughly addresses changes that make C++11 feel like a whole new language, offering definitive guidance for leveraging its improvements in performance, reliability, and clarity. C++ programmers around the world recognize Bjarne Stoustrup as \nthe\n go-to expert for the absolutely authoritative and exceptionally useful information they need to write outstanding C++ programs. Now, as C++11 compilers arrive and development organizations migrate to the new standard, they know exactly where to turn once more: Stoustrup's \nC++ Programming Language, Fourth Edition\n.",
        "InStock": true,
        "Name": "The C++ Programming Language, 4th Edition",
        "Stock": 12,
        "Year": 2,
        "_id": "0-321-56384-0"
    },
    {
        "Author": "Adam Drozdek",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/e6/ce/94/e6ce94a53248171201b7bfe9765121cb.jpg",
        "Department": "CSE",
        "Description": "Strengthen your understanding of data structures and their algorithms for the foundation you need to successfully design, implement and maintain virtually any software system. Theoretical, yet practical, DATA STRUCUTRES AND ALGORITHMS IN C++, 4E by experienced author Adam Drosdek highlights the fundamental connection between data structures and their algorithms, giving equal weight to the practical implementation of data structures and the theoretical analysis of algorithms and their efficiency. This edition provides critical new coverage of treaps, k-d trees and k-d B-trees, generational garbage collection, and other advanced topics such as sorting methods and a new hashing technique. Abundant C++ code examples and a variety of case studies provide valuable insights into data structures implementation. DATA STRUCTURES AND ALGORITHMS IN C++ provides the balance of theory and practice to prepare readers for a variety of applications in a modern, object-oriented paradigm.",
        "InStock": true,
        "Name": "Data Structures and Algorithms in C++",
        "Stock": 8,
        "Year": 2,
        "_id": "1133608426"
    },
    {
        "Author": "Dr. Clifford A. Shaffer",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7e/a3/c3/7ea3c39173f146f675b63b146d1535f3.jpg",
        "Department": "ISE",
        "Description": "A comprehensive treatment focusing on the creation of efficient data structures and algorithms, this text explains how to select or design the data structure best suited to specific problems. It uses C++ as the programming language and is suitable for second-year data structure courses and computer science courses in algorithmic analysis.",
        "InStock": true,
        "Name": "Data Structures and Algorithm Analysis in C++, 3rd Edition",
        "Stock": 7,
        "Year": 2,
        "_id": "9780486485829"
    },
    {
        "Author": "Dr. Durga Das Basu",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/e3/7e/5b/e37e5b31c79c71d14d088f9464b3928e.jpg",
        "Department": "CIPE",
        "Description": "Publisher: LexisNexis Butterworths Wadhwa, 20th Edition, Reprint 2011\n\n\n\r\nAbout the Book: Introduction To The Constitution of India, available in paperback, is a textbook catering to the needs of political science students and enthusiasts, who are interested in learning about the constitution of India. It attempts to help laymen understand the complex concepts in the constitution in an easier way.\n\n\n\r\nThis book describes the journey of India from the day India was declared as a republic country till date. Lots of amendments have been made to the constitution since the time it was first written. The book runs the readers through every detail and provides a consolidated and analytical perspective for the various complexities present in the constitution.\n\n\n\r\nIntroduction To The Constitution of India is made up of 9 chapters. It covers topics like Nature of the Constitution, Administration of Union Territories, Judicature, Government of the Union, Local Government, Government of the States, the Federal System and other topics like Languages, Elections and Public Service Commissions. The book also gives sound information about the judicial system of India, especially the Supreme Court and the High Court. The readers are given in-depth information about India's provisions for emergency situations, minorities, inter-state relations, elections and languages.\n\n\n\r\nThe book, Introduction To The Constitution of India, the twentieth edition, was published in the year 2011. It provides readers with a detailed background about the history, special features, philosophy and creation of India's constitution. It also explains the Directive Principles of State Policy and Fundamental Rights and Duties vivaciously. Apart from that, it gives plenty of information about the functioning of small governments like panchayats, municipalities and planning committees.\n\n\n\r\nUploader Notes: The book is a non-searchable, non-OCR scan (image) of the print edition; it is not published as a digital edition. But a must have for students and practitioners of Constitutional laws in India nonetheless.",
        "InStock": true,
        "Name": "Introduction To The Constitution Of India",
        "Stock": 19,
        "Year": 2,
        "_id": "8180385590"
    },
    {
        "Author": "I.V Murali Krishna and Valli Manickam (Auth.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/18/c8/71/18c871454077960f99619714bf03cc1b.gif",
        "Department": "Environmental Engineering",
        "Description": "Environmental Management: Science and Engineering for Industry consists of 18 chapters, starting with a discussion of International Environmental Laws and crucial environmental management tools, including lifecycle, environmental impact, and environmental risk assessments. This is followed by a frank discussion of environmental control and abatement technologies for water, wastewater, soil, and air pollution.\nIn addition, this book also tackles Hazardous Waste Management and the landfill technologies available for the disposal of hazardous wastes. As managing environmental projects is a complex task with vast amounts of data, an array of regulations, and alternative engineering control strategies designed to minimize pollution and maximize the effect of an environmental program, this book helps readers further understand and plan for this process.",
        "InStock": true,
        "Name": "Environmental Management. Science and Engineering for Industry",
        "Stock": 23,
        "Year": 2,
        "_id": "9780128119891"
    },
    {
        "Author": "Don W Green ,  Marylee Z Southard",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/8d/2f/17/8d2f1741e16e81d584e096d10b6b0127.jpg",
        "Department": "Chemistry",
        "Description": "Publisher's Note: Products purchased from Third Party sellers are not guaranteed by the publisher for quality, authenticity, or access to any online entitlements included with the product.\nUp-to-Date Coverage of All Chemical Engineering Topics―from the Fundamentals to the State of the Art\nNow in its 85th Anniversary Edition, this industry-standard resource has equipped generations of engineers and chemists with vital information, data, and insights. Thoroughly revised to reflect the latest technological advances and processes,\nPerry's Chemical Engineers' Handbook, Ninth Edition\n, provides unsurpassed coverage of every aspect of chemical engineering. You will get comprehensive details on chemical processes, reactor modeling, biological processes, biochemical and membrane separation, process and chemical plant safety, and much more.\nThis fully updated edition covers:\nUnit Conversion Factors and Symbols - Physical and Chemical Data including Prediction and Correlation of Physical Properties - Mathematics including Differential and Integral Calculus, Statistics, Optimization - Thermodynamics - Heat and Mass Transfer - Fluid and Particle Dynamics *Reaction Kinetics - Process Control and Instrumentation- Process Economics - Transport and Storage of Fluids - Heat Transfer Operations and Equipment - Psychrometry, Evaporative Cooling, and Solids Drying - Distillation - Gas Absorption and Gas-Liquid System Design - Liquid-Liquid Extraction Operations and Equipment - Adsorption and Ion Exchange - Gas-Solid Operations and Equipment - Liquid-Solid Operations and Equipment - Solid-Solid Operations and Equipment -Chemical Reactors - Bio-based Reactions and Processing - Waste Management including Air, Wastewater and Solid Waste Management* Process Safety including Inherently Safer Design - Energy Resources, Conversion and Utilization* Materials of Construction",
        "InStock": true,
        "Name": "Perry’s Chemical Engineers’ Handbook",
        "Stock": 18,
        "Year": 2,
        "_id": "0071834087"
    },
    {
        "Author": "Walter Goralski",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/bf/36/41/bf36414750525d9f95fe92d283b3570e.jpg",
        "Department": "CSE",
        "Description": "The Illustrated Network: How TCP/IP Works in a Modern Network, Second Edition presents an illustrated explanation on how TCP/IP works, using consistent examples from a working network configuration that includes servers, routers and workstations. Diagnostic traces allow the reader to follow the discussion with unprecedented clarity and precision. True to its title, there are 330+ diagrams and screenshots, as well as topology diagrams and a unique repeating chapter opening diagram. Illustrations are also used as end-of-chapter questions. Based on examples of a complete and modern network, all the material comes from real objects connected and running on the network.\n\n\n\r\nThe book emphasizes the similarities across all networks, since all share similar components, from the smallest LAN to the global internet. Layered protocols are the rule, and all hosts attached to the Internet run certain core protocols to enable their applications to function properly.\n\n\n\r\nThis second edition includes updates throughout, along with four completely new chapters that introduce developments that have occurred since the publication of the first edition, including optical networking, cloud concepts and VXLAN.\n\n\n\r\n• Gives the reader insights into the most up-to-date network equipment, operating systems and router vendors\n\r\n• Presents an illustrated explanation on how TCP/IP works with consistent examples from a working network configuration that includes servers, routers, and workstations\n\r\n• Contains over 330 Illustrations, screen shots, topology diagrams, and a unique repeating chapter opening diagram to reinforce concepts",
        "InStock": true,
        "Name": "The Illustrated Network: How TCP/IP Works in a Modern Network",
        "Stock": 29,
        "Year": 2,
        "_id": "0128110279"
    },
    {
        "Author": "Charu C. Aggarwal",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/ad/21/aa/ad21aa5fcf5594e94031109a99c7c17a.jpg",
        "Department": "CSE",
        "Description": "This book covers both classical and modern models in deep learning. The primary focus is on the theory and algorithms of deep learning. The theory and algorithms of neural networks are particularly important for understanding important concepts, so that one can understand the important design concepts of neural architectures in different applications. Why do neural networks work? When do they work better than off-the-shelf machine-learning models? When is depth useful? Why is training neural networks so hard? What are the pitfalls?\nThe book is also rich in discussing different applications in order to give the practitioner a flavor of how neural architectures are designed for different types of problems. Applications associated with many different areas like recommender systems, machine translation, image captioning, image classification, reinforcement-learning based gaming, and text analytics are covered.\nThe chapters of this book span three categories:\nThe basics of neural networks:\n Many traditional machine learning models can be understood as special cases of neural networks. An emphasis is placed in the first two chapters on understanding the relationship between traditional machine learning and neural networks. Support vector machines, linear/logistic regression, singular value decomposition, matrix factorization, and recommender systems are shown to be special cases of neural networks. These methods are studied together with recent feature engineering methods like word2vec.\nFundamentals of neural networks:\n A detailed discussion of training and regularization is provided in Chapters 3 and 4. Chapters 5 and 6 present radial-basis function (RBF) networks and restricted Boltzmann machines.\nAdvanced topics in neural networks:\n Chapters 7 and 8 discuss recurrent neural networks and convolutional neural networks. Several advanced topics like deep reinforcement learning, neural Turing machines, Kohonen self-organizing maps, and generative adversarial networks are introduced in Chapters 9 and 10.\nThe book is written for graduate students, researchers, and practitioners. Numerous exercises are available along with a solution manual to aid in classroom teaching. Where possible, an application-centric view is highlighted in order to provide an understanding of the practical uses of each class of techniques.",
        "InStock": true,
        "Name": "Neural Networks and Deep Learning: A Textbook",
        "Stock": 23,
        "Year": 3,
        "_id": "3319944622"
    },
    {
        "Author": "Michael Taylor",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/64/2b/0a/642b0a1525eb480db2dd5b625238fb1f.jpg",
        "Department": "ISE",
        "Description": "A step-by-step visual journey through the mathematics of neural networks, and making your own using Python and Tensorflow.",
        "InStock": true,
        "Name": "Neural Networks: A Visual Introduction for Beginners",
        "Stock": 17,
        "Year": 3,
        "_id": "1549869132"
    },
    {
        "Author": "Erich Gamma ,  Richard Helm ,  Ralph Johnson ,  John M. Vlissides",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/49/63/a7/4963a7703acf363425e8099d6b12d2dc.jpg",
        "Department": "CSE",
        "Description": "Four top-notch authors present the first book containing a catalog of object-oriented design patterns. Readers will learn how to use design patterns in the object-oriented development process, how to solve specific design problems using patterns, and gain a common vocabulary for object-oriented design.",
        "InStock": false,
        "Name": "Design Patterns: Elements of Reusable Object-Oriented Software",
        "Stock": 0,
        "Year": 2,
        "_id": "0201633612"
    },
    {
        "Author": "William Stallings",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/11/bf/65/11bf6591f3bd2f6a4430131aa2132842.jpg",
        "Department": "CSE",
        "Description": "Data and Computer Communications, 10e,\n is a two-time winner of the best Computer Science and Engineering textbook of the year award from the Textbook and Academic Authors Association. It is ideal for one/two-semester courses in Computer Networks, Data Communications, and Communications Networks in CS, CIS, and Electrical Engineering departments. This book is also suitable for Product Development personnel, Programmers, Systems Engineers, Network Designers and others involved in the design of data communications and networking products.\n \n \nWith a focus on the most current technology and a convenient modular format, this best-selling text offers a clear and comprehensive survey of the entire data and computer communications field. Emphasizing both the fundamental principles as well as the critical role of performance in driving protocol and network design, it explores in detail all the critical technical areas in data communications, wide-area networking, local area networking, and protocol design.",
        "InStock": false,
        "Name": "Data and Computer Communications",
        "Stock": 0,
        "Year": 2,
        "_id": "0133506487"
    },
    {
        "Author": "Maddie Stigler (auth.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/54/f6/9b/54f69b19a60df131be42af6b544747f4.jpg",
        "Department": "CSE",
        "Description": "Learn the basics of serverless computing and how to develop event-driven architectures with the three major cloud platforms: Amazon Web Services, Microsoft Azure, and Google Cloud. This hands-on guide dives into the foundations of serverless computing, its use cases, and how to apply it using developer tools such as Node.js, Visual Studio Code, Postman, and Serverless Framework. You will apply the fundamentals of serverless technology from the ground up, and come away with a greater understanding of its power and how to make it work for you.\nThis book teaches you how to quickly and securely develop applications without the hassle of configuring and maintaining infrastructure. You will learn how to harness serverless technology to rapidly reduce production time and minimize your costs, while still having the freedom to customize your code, without hindering functionality. Upon completion, you will have the knowledge and resources to build your own serverless application hosted in AWS, Azure, or Google Cloud and will have experienced the benefits of event-driven technology for yourself.\nWhat You'll Learn \nGain a deeper understanding of serverless computing and when to use it\nUse development tools such as Node.js, Postman, and VS code to quickly set up your serverless development environment and produce applications\nApply triggers to your serverless functions that best suit the architecture for the problem the functions are solving\nBegin building applications across cloud providers that utilize the power of serverless technology\nUnderstand best development practices with serverless computing to maintain scalable and practical solutions\nCode with an agnostic approach to cloud providers to minimize provider dependency\nWho This Book Is For\nAny developer looking to expand current knowledge of serverless computing, its applications, and how to architect serverless solutions, or someone just beginning in these areas",
        "InStock": true,
        "Name": "Beginning Serverless Computing: Developing with Amazon Web Services, Microsoft Azure, and Google Cloud",
        "Stock": 20,
        "Year": 4,
        "_id": "978-1-4842-3084-8"
    },
    {
        "Author": "Dan Sullivan",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/2f/61/89/2f61897d7e3bdafba45c82cc91496324.jpg",
        "Department": "CSE",
        "Description": "In Google Cloud Certified Associate Cloud Engineer Study Guide, readers get ready for this important exam from Google and master the skills they need to be prepared to tackle Google Cloud Architecture jobs. With 100% coverage of all exam objectives readers will learn:\nDesigning for Business and Technical Requirements Designing Compute Resources Designing Storage Systems Designing Networks Designing Security and Legal Compliance Designing for Reliability Analyzing and Defining Technical Processes Analyzing and Defining Business Processes Development and Operations Migration Planning",
        "InStock": false,
        "Name": "Official Google Cloud Certified Professional Cloud Architect Study Guide",
        "Stock": 0,
        "Year": 4,
        "_id": "1119602440"
    },
    {
        "Author": "Dan C. Marinescu",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/c7/85/c3/c785c3527d45fd7038e731e0d4eaac38.jpg",
        "Department": "ISE",
        "Description": "Cloud Computing: Theory and Practice, Second Edition,\nprovides students and IT professionals with an in-depth analysis of the cloud from the ground up. After an introduction to network-centric computing and network-centric content in Chapter One, the book is organized into four sections. Section One reviews basic concepts of concurrency and parallel and distributed systems. Section Two presents such critical components of the cloud ecosystem as cloud service providers, cloud access, cloud data storage, and cloud hardware and software. Section Three covers cloud applications and cloud security, while Section Four presents research topics in cloud computing.\nSpecific topics covered include resource virtualization, resource management and scheduling, and advanced topics like the impact of scale on efficiency, cloud scheduling subject to deadlines, alternative cloud architectures, and vehicular clouds. An included glossary covers terms grouped in several categories, from general to services, virtualization, desirable attributes and security.\nIncludes new chapters on concurrency, cloud hardware and software, challenges posed by big data and mobile applications and advanced topics\nProvides a new appendix that presents several cloud computing projects\nPresents more than 400 references in the text, including recent research results in several areas related to cloud computing",
        "InStock": false,
        "Name": "Cloud Computing: Theory and Practice",
        "Stock": 0,
        "Year": 2,
        "_id": "0128128100"
    },
    {
        "Author": "Mikell P. Groover",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/aa/56/1e/aa561e3b001d0d01742d87dcf20bcb52.jpg",
        "Department": "IPE",
        "Description": "Engineers rely on Groover because of the book’s quantitative and engineering-oriented approach that provides more equations and numerical problem exercises. The fifth edition introduces more modern topics, including new materials, processes and systems.  End of chapter problems are also thoroughly revised to make the material more relevant. Several figures have been enhanced to significantly improve the quality of artwork. All of these changes will help engineers better understand the topic and how they apply it in the field.",
        "InStock": false,
        "Name": "Fundamentals of Modern Manufacturing: Materials, Processes, and Systems",
        "Stock": 0,
        "Year": 3,
        "_id": "1118231465"
    },
    {
        "Author": "Myer Kutz",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/07/66/34/0766348bdb3f37f4ebe9554f1a77426f.jpg",
        "Department": "Mechanical",
        "Description": "Full coverage of manufacturing and management in mechanical engineering\n \nMechanical Engineers' Handbook, Fourth Edition\n provides a quick guide to specialized areas that engineers may encounter in their work, providing access to the basics of each and pointing toward trusted resources for further reading, if needed. The book's accessible information offers discussions, examples, and analyses of the topics covered, rather than the straight data, formulas, and calculations found in other handbooks. No single engineer can be a specialist in all areas that they are called upon to work in. It's a discipline that covers a broad range of topics that are used as the building blocks for specialized areas, including aerospace, chemical, materials, nuclear, electrical, and general engineering.\n \nThis third volume of \nMechanical Engineers' Handbook\n covers Manufacturing & Management, and provides accessible and in-depth access to the topics encountered regularly in the discipline: environmentally benign manufacturing, production planning, production processes and equipment, manufacturing systems evaluation, coatings and surface engineering, physical vapor deposition, mechanical fasteners, seal technology, statistical quality control, nondestructive inspection, intelligent control of material handling systems, and much more.\n \n \nPresents the most comprehensive coverage of the entire discipline of Mechanical Engineering\n \nFocuses on the explanation and analysis of the concepts presented as opposed to a straight listing of formulas and data found in other handbooks\n \nOffers the option of being purchased as a four-book set or as single books\n \nComes in a subscription format through the Wiley Online Library and in electronic and other custom formats\n \n \nEngineers at all levels of industry, government, or private consulting practice will find \nMechanical Engineers' Handbook, Volume 3\n an \"off-the-shelf\" reference they'll turn to again and again.",
        "InStock": true,
        "Name": "Manufacturing and Management",
        "Stock": 20,
        "Year": 3,
        "_id": "1118112849"
    },
    {
        "Author": "Albert Lester Qualifications: CEng  FICE  FIMech.E  FIStruct.E  FAPM",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d6/52/c7/d652c7c81532b6d7caf258aaabc699bc.jpg",
        "Department": "CSE",
        "Description": "Project Management, Planning and Control, Managing Engineering, Construction and Manufacturing Projects to PMI, APM and BSI Standards, Seventh Editions\n an established and widely recommended project management handbook. \n \nBuilding on its clear and detailed coverage of planning, scheduling and control, this seventh edition includes new advice on information management, including big data, communication, dispute resolution, project governance, and BIM.\n \nIdeal for those studying for Project Management Professional (PMP) qualifications, the book is aligned with the latest Project Management Body of Knowledge (PMBOK) for both the Project Management Institute (PMI) and the Association of Project Management (APM), and includes questions and answers to help users test their understanding. \nIncludes new sections on data collection and use, including big data\nContains major updates to sections on governance, adjudication, BIM, and agile project management\nFocused on the needs and challenges of project managers in engineering, manufacturing and construction, and closely aligned to the content of the APM and PMI ‘bodies of knowledge’\nProvides project management questions and answers compiled by a former APM exam assessor",
        "InStock": false,
        "Name": "Project Management, Planning and Control, Seventh Edition: Managing Engineering, Construction and Manufacturing Projects to PMI, APM and BSI Standards",
        "Stock": 0,
        "Year": 2,
        "_id": "0081020201"
    },
    {
        "Author": "Geoff Klempner ,  Isidor Kerszenbaum",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7c/af/67/7caf67478a18b46d328fd715246c7d8e.jpg",
        "Department": "EEE",
        "Description": "The comprehensive guide for the operation and maintenance of large turbo-generators    \n    Operation and Maintenance of Large Turbo-Generators is the ultimate resource for operators and inspectors of large utility and industrial generating facilities who deal with multiple units of disparate size, origin, and vintage. It offers the complete scope of information regarding operation and maintenance of all types of turbine-driven generators built in the world.    \n    Based on the authors’ combined sixty years of generating station and design work experience, the information presented in the book is designed to inform the reader about actual machine operational problems and failure modes that occur in generating stations and other types of facilities. Readers will find very detailed coverage of:      \n \nDesign and construction of generators and auxiliary systems      \nGenerator operation, including interaction with the grid      \nMonitoring, diagnostics, and protection of turbo-generators      \nInspection practices, including stator, rotor, and auxiliary systems      \nIdeas for improving plant reliability and reducing costs and electrical failures      \nMaintenance testing, including electrical and nondestructive examination      \n \n    Operation and Maintenance of Large Turbo-Generators comes filled with photos and graphs, commonly used inspection forms, and extensive references for each topic. It is an indispensable resource for anyone involved in the design, construction, protection, operation, maintenance, and troubleshooting of large generators in generating stations and industrial power facilities. The book is also an excellent learning tool for students, consultants, and design engineers.",
        "InStock": true,
        "Name": "Operation and maintenance of large turbo-generators",
        "Stock": 21,
        "Year": 2,
        "_id": "0471614475"
    },
    {
        "Author": "Charles Alexander ,  Matthew Sadiku",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/09/64/aa/0964aa51aa7599b25b7ad6fe675b602e.jpg",
        "Department": "EEE",
        "Description": "Alexander and Sadikus fifth edition of Fundamentals of Electric Circuits continues in the spirit of its successful previous editions, with the objective of presenting circuit analysis in a manner that is clearer, more interesting, and easier to understand than other, more traditional texts. Students are introduced to the sound, six-step problem solving methodology in chapter one, and are consistently made to apply and practice these steps in practice problems and homework problems throughout the text.  A balance of theory, worked examples and extended examples, practice problems, and real-world applications, combined with over 468 new or changed homework problems for the fifth edition and robust media offerings, renders the fifth edition the most comprehensive and student-friendly approach to linear circuit analysis.  This edition retains the Design a Problem feature which helps students develop their design skills by having the student develop the question as well as the solution. There are over 100 Design a Problem exercises integrated into the problem sets in the book.",
        "InStock": true,
        "Name": "Fundamentals of Electric Circuits",
        "Stock": 17,
        "Year": 1,
        "_id": "0073380571"
    },
    {
        "Author": "Sang-Hoon Kim",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/4b/a7/0b/4ba70b1f999f57a5a7935dde7c946f88.jpg",
        "Department": "EEE",
        "Description": "Electric Motor Control: DC, AC, and BLDC Motors introduces practical drive techniques of electric motors to enable stable and efficient control of many application systems, also covering basic principles of high-performance motor control techniques, driving methods, control theories and power converters.\n\n\n\r\nElectric motor drive systems play a critical role in home appliances, motor vehicles, robotics, aerospace and transportation, heating ventilating and cooling equipment’s, robotics, industrial machinery and other commercial applications.\n\n\n\r\nThe book provides engineers with drive techniques that will help them develop motor drive system for their applications.",
        "InStock": false,
        "Name": "Electric Motor Control",
        "Stock": 0,
        "Year": 1,
        "_id": "9780128123195"
    },
    {
        "Author": "Richard Fitzpatrick",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/9c/b8/00/9cb80080df2cc84f868c8fba96743ca1.jpg",
        "Department": "Physics",
        "Description": "Designed for upper division electromagnetism courses or as a reference for electrical engineers and scientists, this book introduces Maxwell s equations and electromagnetic waves as soon as possible (i.e., in the first third of the book), and then discusses electrostatics, magnetostatics, induction, etc., in the light of those equations. The book also provides a thorough treatment of vector field theory which emphasizes the rotational invariance of the dot and cross products, together with div, grad, and curl, and thus gives a clear physical motivation for the use of those constructs to describe electric and magnetic fields. Unlike many competing books, Maxwell s Equations & the Principles of Electromagnetism covers topics such as advanced potentials, retarded fields, forces on dielectric liquids, antenna theory, and Faraday rotation. *BRIEF TABLE OF CONTENTS: 1. Introduction. 2. Vectors and Vector Fields. 3. Time-Independent Maxwell s Equations. 4. Time-Dependent Maxwell s Equations. 5. Electrostatic Calculations. 6. Dielectric and Magnetic Media. 7. Magnetic Induction.8.Electromagnetic Energy and Momentum. 9. Electromagnetic Radiation. 10. Relativity and Electromagnetism. Appendixes. Index.",
        "InStock": true,
        "Name": "Maxwell's Equations and the Principles of Electromagnetism",
        "Stock": 15,
        "Year": 2,
        "_id": "1934015202"
    },
    {
        "Author": "Wai Kai Chen",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/b6/51/5e/b6515efd4f76c9f215234332c4e1b0e4.jpg",
        "Department": "EEE",
        "Description": "The Electrical Engineer's Handbook is an invaluable reference source for all practicing electrical engineers and students. No other book has the breadth and depth of coverage available here. 77 chapters encompass the entire field of electrical engineering.THOUSANDS of valuable figures, tables, formulas, and definitions.Extensive bibliographic references....a surprisingly broad range of electrical topics of great concern to almost all modern engineers. The authors have assembled an authoritative and comprehensive reference tool specifically targeting practicing engineers. And, the volume has the potential to become a classic modern electrical engineering handbook. While it encompases many traditional subjects, it also addresses many areas of current research activity and international interest\"\"",
        "InStock": true,
        "Name": "The electrical engineering handbook",
        "Stock": 13,
        "Year": 2,
        "_id": "0121709604"
    },
    {
        "Author": "Sergey Ablameyko PhD ,  DSc ,  Prof ,  FIEE ,  FIAPR ,  SMIEEE ,  Tony Pridmore BSc ,  PhD (auth.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d1/3e/7a/d13e7a2cd8d3a30400881f55542e88e6.jpg",
        "Department": "CSE",
        "Description": "Line drawing interpretation is a challenging area with enormous practical potential. At present, many companies throughout the world invest large amounts of money and human resource in the input of paper drawings into computers. The technology needed to produce an image of a drawing is widely available, but the transformation of these images into more useful forms is an active field of research and development. \nMachine Interpretation of Line Drawing Images\n- describes the theory and practice underlying the computer interpretation of line drawing images and\n- shows how line drawing interpretation systems can be developed.\nThe authors show how many of the problems can be tackled and provide a thorough overview of the processes underpinning the interpretation of images of line drawings.",
        "InStock": true,
        "Name": "Machine Interpretation of Line Drawing Images: Technical Drawings, Maps and Diagrams",
        "Stock": 29,
        "Year": 2,
        "_id": "978-1-4471-0789-7"
    },
    {
        "Author": "Krishnamurthy ,  L. ,  Raghavendra ,  N. V",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/70/62/47/7062475f401fec2ab87bfd7e7adf1186.jpg",
        "Department": "IPE",
        "Description": "Engineering Metrology and Measurements is a textbook designed for students of mechanical, production and allied disciplines to facilitate learning of various shop-floor measurement techniques and also understand the basics of mechanical measurements.\n \nWith a conventional introduction to the principles and standards of measurement, the book in subsequent chapters takes the reader through the important topics of metrology such as limits, fits and tolerances, linear measurements, angular measurements, comparators, optical measurements. The last few chapters discuss the measurement concepts of simple physical parameters such as force, torque, strain, temperature, and pressure, before introducing the contemporary information on nanometrology as the last chapter.\n \nAdopting an illustrative approach to explain the concepts, the book presents solved numerical problems, practice problems, review questions, and multiple choice questions.",
        "InStock": true,
        "Name": "Engineering metrology and measurements",
        "Stock": 24,
        "Year": 2,
        "_id": "1680152807"
    },
    {
        "Author": "Bucher ,  Jay L",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/fe/ca/0e/feca0ed23fd0c92c36d73454e6b1a86b.jpg",
        "Department": "IPE",
        "Description": "Throughout history, manufacturing has made huge leaps thanks to improvements in measurement. Much of what designers or manufacturers do is accomplished through the use of accurate calibration and measurements. The study of metrology and calibration fills immense volumes of literature that forms a vast body of technical knowledge from which professionals are challenged to absorb. Developed as a practical reference for metrology and calibration professionals, The Metrology Handbook provides a foundation for understanding basic metrology and calibration principles and practices, and is appropriate for those with intermediate or advanced experience seeking to increase their knowledge. This book is a collection of valuable information compiled by experts in the field to serve as a single resource for metrology and calibration professionals. The supplemental CD-ROM contains acronyms and abbreviations, a glossary of terms, tables and formulas, and common conversions. Sponsored by ASQ s Measurement Quality Division, this handbook serves as an excellent desktop reference for calibration technicians, supervisors, managers, quality inspectors, auditors, those in calibration and/or testing laboratories, consultants, and teachers. Whether you re changing disciplines in your career field, helping to becoming certified to a new or different standard, accepting more responsibilities as a supervisor or manager, training your fellow calibration practitioners, or using it to prepare for ASQ s Certified Calibration Technician (CCT) exam, this handbook provides the information, guidance, and knowledge to help you achieve your goals",
        "InStock": true,
        "Name": "The Metrology Handbook, Second Edition",
        "Stock": 17,
        "Year": 2,
        "_id": "1621983129"
    },
    {
        "Author": "Vinod Thombre Patil",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d1/3a/1e/d13a1e0d3ef3508655c6d80c9db20348.jpg",
        "Department": "IPE",
        "Description": "I am glad to present the Vth edition of book entitled “Metrology and Quality\n\r\nControl” for IIIrd year Diploma in Mechanical engineering as per the “G” Scheme code\n\r\nsyllabus prescribed by MSBTE.\n\r\nI have observed the students facing extreme difficulties in understanding the basic\n\r\nprinciples and fundamental concepts without adequate solved problems along with the\n\r\ntext. To meet this basic requirement of students, sincere efforts have been made to\n\r\npresent the subject matter with frequent use of figures and lots of numerical\n\r\nexamples.",
        "InStock": true,
        "Name": "Metrology and Quality Control",
        "Stock": 22,
        "Year": 2,
        "_id": "978-93-83971-66-4"
    },
    {
        "Author": "Meenakshi ,  Kamal Rawat",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/cc/aa/5c/ccaa5c6429a0954d69371d5b2b411060.jpg",
        "Department": "CSE",
        "Description": "I wanted to compute 80th term of the Fibonacci series. I wrote the rampant recursive function, \n\n\n\r\nint fib(int n){ \n\n\n\r\nreturn (1==n || 2==n) ? 1 : fib(n-1) + fib(n-2); \n\n\n\r\n} \n\n\n\r\nand waited for the result. I wait… and wait… and wait… \n\n\n\r\nWith an 8GB RAM and an Intel i5 CPU, why is it taking so long? I terminated the process and tried computing the 40th term. It took about a second. I put a check and was shocked to find that the above recursive function was called 204,668,309 times while computing the 40th term. \n\n\n\r\nMore than 200 million times? Is it reporting function calls or scam of some government? \n\n\n\r\nThe Dynamic Programming solution computes 100th Fibonacci term in less than fraction of a second, with a single function call, taking linear time and constant extra memory. \n\n\n\r\nA recursive solution, usually, neither pass all test cases in a coding competition, nor does it impress the interviewer in an interview of company like Google, Microsoft, etc. \n\n\n\r\nThe most difficult questions asked in competitions and interviews, are from dynamic programming. This book takes Dynamic Programming head-on. It first explain the concepts with simple examples and then deep dives into complex DP problems.",
        "InStock": true,
        "Name": "Dynamic Programming for Coding Interviews: A Bottom-Up Approach to Problem Solving",
        "Stock": 29,
        "Year": 2,
        "_id": "9781946556707"
    },
    {
        "Author": "Russell Charles Hibbeler",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/ce/1e/90/ce1e90dc739863a9788f6324038e2dfb.jpg",
        "Department": "Mechanical",
        "Description": "(For Statics, Dynamics, and Combined Statics & Dynamics Courses)\n\n\n\r\nA Proven Approach to Conceptual Understanding and Problem-solving Skills.\n\n\n\r\nEngineering Mechanics: Statics & Dynamics excels in providing a clear and thorough presentation of the theory and application of engineering mechanics. Engineering Mechanics empowers students to succeed by drawing upon Prof. Hibbeler’s everyday classroom experience and his knowledge of how students learn. This text is shaped by the comments and suggestions of hundreds of reviewers in the teaching profession, as well as many of the author’s students.\n\n\n\r\nThe Fourteenth Edition includes new Preliminary Problems, which are intended to help students develop conceptual understanding and build problem-solving skills. The text features a large variety of problems from a broad range of engineering disciplines, stressing practical, realistic situations encountered in professional practice, and having varying levels of difficulty.",
        "InStock": true,
        "Name": "Engineering Mechanics: Statics & Dynamics",
        "Stock": 27,
        "Year": 2,
        "_id": "0133915425"
    },
    {
        "Author": "Michel Geradin ,  Daniel J. Rixen",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/83/38/55/833855050a2543cf52ae627068188259.jpg",
        "Department": "Physics",
        "Description": "Mechanical Vibrations: Theory and Application to Structural Dynamics, Third Edition is a comprehensively updated new edition of the popular textbook. It presents the theory of vibrations in the context of structural analysis and covers applications in mechanical and aerospace engineering. Although keeping the same overall structure, the content of this new edition has been significantly revised in order to cover new topics, enhance focus on selected important issues, provide sets of exercises and improve the quality of presentation. Without being exhaustive (see the Introduction for a comprehensive list), some key features include: a systematic approach to dynamic reduction and substructuring, based on duality between mechanical and admittance concepts; an introduction to experimental modal analysis and identification methods; an improved, more physical presentation of wave propagation phenomena; a comprehensive presentation of current practice for solving large eigenproblems, focusing on the efficient linear solution of large, sparse and possibly singular systems; a deeply revised description of time integration schemes, providing framework for the rigorous accuracy/stability analysis of now widely used algorithms such as HHT and Generalized; solved exercises and end of chapter homework problems; and, a companion website hosting supplementary material. With revised, coherent and uniform notation, Mechanical Vibrations: Theory and Application to Structural Dynamics, Third Edition is a must-have textbook for graduate students working with vibration in mechanical, aerospace and civil engineering, and is also an excellent reference for researchers and industry practitioners.",
        "InStock": true,
        "Name": "Mechanical Vibrations: Theory and Application to Structural Dynamics",
        "Stock": 16,
        "Year": 2,
        "_id": "1118900200"
    },
    {
        "Author": "Walter Greiner (auth.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/56/3d/e8/563de8148acf32f439c0256ea601421f.jpg",
        "Department": "Physics",
        "Description": "This textbook Classical Mechanics provides a complete survey on all aspects of classical mechanics in theoretical physics. An enormous number of worked examples and problems show students how to apply the abstract principles to realistic problems.\nThe textbook covers Newtonian mechanics in rotating coordinate systems, mechanics of systems of point particles, vibrating systems and mechanics of rigid bodies. It thoroughly introduces and explains the Lagrange and Hamilton equations and the Hamilton-Jacobi theory. A large section on nonlinear dynamics and chaotic behavior of systems takes Classical Mechanics to newest development in physics.\nThe new edition is completely revised and updated. New exercises and new sections in canonical transformation and Hamiltonian theory have been added.",
        "InStock": true,
        "Name": "Classical Mechanics: Systems of Particles and Hamiltonian Dynamics",
        "Stock": 11,
        "Year": 2,
        "_id": "3642034330"
    },
    {
        "Author": "Lenny Smith ,  Leonard Smith",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/47/ba/d2/47bad29400c3329e70aea3df1aa9009e.jpg",
        "Department": "Physics",
        "Description": "Chaos exists in systems all around us. Even the simplest system can be subject to chaos, denying us accurate predictions of its behavior, and sometimes giving rise to astonishing structures of large-scale order. Here, Leonard Smith shows that we all have an intuitive understanding of chaotic systems. He uses accessible math and physics to explain Chaos Theory, and points to numerous examples in philosophy and literature that illuminate the problems. This book provides a complete understanding of chaotic dynamics, using examples from mathematics, physics, philosophy, and the real world, with an explanation of why chaos is important and how it differs from the idea of randomness. The author's real life applications include the weather forecast, a pendulum, a coin toss, mass transit, politics, and the role of chaos in gambling and the stock market. Chaos represents a prime opportunity for mathematical lay people to finally get a clear understanding of this fascinating concept.",
        "InStock": true,
        "Name": "Chaos: A Very Short Introduction",
        "Stock": 6,
        "Year": 2,
        "_id": "0192853783"
    },
    {
        "Author": "Ashleigh Fuller ,  Antonio Ramirez ,  Douglas Smith",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/63/8c/68/638c681291d9a5c21e37ccb2e8095bd2.jpg",
        "Department": "CSE",
        "Description": "Technical Drawing 101 covers topics ranging from the most basic, such as making freehand, multiview sketches of machine parts, to the advanced creating an AutoCAD dimension style containing the style settings defined by the ASME Y14.5-2009 Dimensioning and Tolerancing standard. But unlike the massive technical drawing reference texts on the market, Technical Drawing 101 aims to present just the right mix of information and projects that can be reasonably covered by faculty, and assimilated by students, in one semester. Both mechanical and architectural projects are introduced to capture the interest of more students and to offer a broader appeal.\n\n\n\r\nThe CAD portion of the text incorporates drafting theory whenever possible and covers the basics of drawing setup (units, limits, and layers), the tools of the Draw, Modify, and Dimension toolbars, and the fundamentals of 3D modeling. By focusing on the fundamental building blocks of CAD, Technical Drawing 101 provides a solid foundation for students going on to learn advanced CAD concepts and techniques (paper space, viewports, xrefs, annotative scaling, etc.) in intermediate CAD courses.\n\n\n\r\nIn recognition of the diverse career interests of our students, Technical Drawing 101 includes projects in which students create working drawings for a mechanical assembly as well as for an architectural project. We include architectural drawing because our experience has shown that many (if not most) first-semester drafting students are interested in careers in the architectural design field, and that a traditional technical drawing text, which focuses solely on mechanical drawing projects, holds little interest for these students. The multidisciplinary approach of this text and its supporting materials are intended to broaden the appeal of the curriculum and increase student interest and, it is hoped, future enrollments.",
        "InStock": true,
        "Name": "Technical Drawing 101 with AutoCAD 2017",
        "Stock": 14,
        "Year": 2,
        "_id": "978-1630570415"
    },
    {
        "Author": "Paul Tran",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/5f/e2/61/5fe2612a2bc4743021bed8088c844779.jpg",
        "Department": "CSE",
        "Description": "SOLIDWORKS 2016 Advanced Techniques picks up where SOLIDWORKS 2016 Intermediate Skills leaves off. Its aim is to take you from an intermediate user with a basic understanding of SOLIDWORKS and modeling techniques to an advanced user capable of creating complex models and able to use the advanced tools provided by SOLIDWORKS. The text covers parts, surfaces, SimulationXpress, sheet metal, top-down assemblies and core and cavity molds.  Every lesson and exercise in this book was created based on real world projects. Each of these projects have been broken down and developed into easy and comprehensible steps for the reader. Furthermore, at the end of every chapter there are self test questionnaires to ensure that the reader has gained sufficient knowledge from each section before moving on to more advanced lessons. This book takes the approach that in order to understand SOLIDWORKS, inside and out, the reader should create everything from the beginning and take it step by step.",
        "InStock": true,
        "Name": "SOLIDWORKS 2016 Advanced Techniques",
        "Stock": 12,
        "Year": 2,
        "_id": "1630570028"
    },
    {
        "Author": "Steve Heather",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1b/f6/b6/1bf6b69e137565afc9c69dac7427bd6e.jpg",
        "Department": "ISE",
        "Description": "World-class AutoCAD expert Steve Heather, co-author with Cheryl Shrock of the Beginning AutoCAD Exercise Workbook, Advanced AutoCAD Exercise Workbook, and the AutoCAD Pocket Reference, has written this ground-breaking text, covering step-by-step 3D applications for all AutoCAD users.\n\n\n\r\nThe AutoCAD® 3D Modeling Exercise Workbook is designed for classroom instruction and self-study alike, and is suitable for both inch and metric users. There are 8 lessons and 4 modeling projects, all of which are heavily illustrated, for visual learners.\n\n\n\r\nEach lesson starts with step-by-step instructions on how to create 3D solid models, followed by exercises designed for practicing the commands readers learned within that lesson. The modeling projects are designed so that users can create complex 3D models by combining many of the commands learned within the previous lessons.\n\n\n\r\nDownloadable sample files are provided to accompany some of the lessons and modeling projects, so readers can follow along and customize their creations to suit their own needs.\n\n\n\r\nWritten by Steve Heather, bestselling author and official Beta Tester of AutoCAD software, this is an invaluable resource for the thousands of designers, architects, and manufacturers who are using AutoCAD to create their own 3D models and transfer them to a 3D printer for manufacturing and use in the real world. If you want to learn more about cutting-edge 3D design, printing, and more using AutoCAD, the AutoCAD 3D Modeling Exercise Workbook is for you.",
        "InStock": true,
        "Name": "AutoCAD 3D Modeling : Exercise Workbook",
        "Stock": 29,
        "Year": 2,
        "_id": "9780831136130"
    },
    {
        "Author": "Kunwoo Lee",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/e1/ea/f6/e1eaf600418b306152f8eb4547da4919.jpg",
        "Department": "CSE",
        "Description": "An Introduction to CAD/CAM/CAE is a timely text with coverage of many modern topics, including: rapid prototyping, virtual engineering, NT-based solid modeling systems, and Web-related issues. This book provides balanced coverage of CAD/CAM (with slightly more emphasis on CAD topics) and bonus coverage of computer-aided engineering (CAE). This book's emphasis on the integration of three related disciplines-CAD, CAM, and CAE-makes it a great theoretical introduction to all subjects from geometric representation to the most sophisticated CAE subjects. Many illustrations and references ground the theory in practical examples.   The book also features a unique illustration of the whole product development process through a practical case study that gives readers a clear idea how CAD, CAM, and CAE systems are integrated to accelerate the product development process.   This book is carefully targeted toward today's students; topics are introduced in a concise, efficient manner, with mathematical terminology that is kept to a minimum. A background in programming, calculus, and matrix and vector algebra is helpful when using this text.",
        "InStock": true,
        "Name": "Principles of CAD/CAM/CAE",
        "Stock": 17,
        "Year": 2,
        "_id": "0201380366"
    },
    {
        "Author": "Lydia Cline",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1e/16/9f/1e169f15b7683ad637012f8568968e4c.jpg",
        "Department": "CSE",
        "Description": "Model and print your own 3D creations using SketchUp!Get up and running fast in the consumer design and fabrication world using the hands-on information in this guide. 3D Printing and CNC Fabrication with SketchUp features step-by-step tutorials of fun and easy DIY projects. Learn how to create your own 3D models, edit downloaded models, make them printable, and bring them to physical life either on your own printer or through an online service bureau. \nDownload and install SketchUp on your Mac or PC\nNavigate the interface and SketchUp’s native design tools \nDownload design and analysis tools from the Extension Warehouse.\nEdit models downloaded from the 3D Warehouse and Thingiverse. \nImport and export STL files.\nAnalyze your projects for 3D printability. \nSet up, use, and maintain a home 3D printer\nWork with AutoCAD, 123D Make, 123D Meshmixer, and Vetric Cut2D\nGenerate files for CNC cutters",
        "InStock": true,
        "Name": "3D Printing and CNC Fabrication with SketchUp",
        "Stock": 6,
        "Year": 2,
        "_id": "0071842411"
    },
    {
        "Author": "Yunus Çengel ,  John M. Cimbala",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/88/a2/b8/88a2b80c44d17ebcbd158a4679e883ce.jpg",
        "Department": "Mechanical",
        "Description": "Cengel and Cimbala's Fluid Mechanics Fundamentals and Applications, communicates directly with tomorrow's engineers in a simple yet precise manner, while covering the basic principles and equations of fluid mechanics in the context of numerous and diverse real-world engineering examples. The text helps students develop an intuitive understanding of fluid mechanics by emphasizing the physics, using figures, numerous photographs and visual aids to reinforce the physics. The highly visual approach enhances the learning of fluid mechanics by students. This text distinguishes itself from others by the way the material is presented - in a progressive order from simple to more difficult, building each chapter upon foundations laid down in previous chapters. In this way, even the traditionally challenging aspects of fluid mechanics can be learned effectively.McGraw-Hill Education's Connect, is also available as an optional, add on item. Connect is the only integrated learning system that empowers students by continuously adapting to deliver precisely what they need, when they need it, how they need it, so that class time is more effective. Connect allows the professor to assign homework, quizzes, and tests easily and automatically grades and records the scores of the student's work. Problems are randomized to prevent sharing of answers an may also have a \"multi-step solution\" which helps move the students' learning along if they experience difficulty.",
        "InStock": true,
        "Name": "Fluid Mechanics Fundamentals and Applications",
        "Stock": 21,
        "Year": 2,
        "_id": "1259696537"
    },
    {
        "Author": "Yunus A. Çengel ,  Afshin J. Ghajar",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7a/3b/bc/7a3bbca8cdcabc8678a568241a08dcf6.jpg",
        "Department": "Mechanical",
        "Description": "With complete coverage of the basic principles of heat transfer and a broad range of applications in a flexible format, Heat and Mass Transfer: Fundamentals and Applications, by Yunus Cengel and Afshin Ghajar provides the perfect blend of fundamentals and applications. The text provides a highly intuitive and practical understanding of the material by emphasizing the physics and the underlying physical phenomena involved.\n\r\nThis text covers the standard topics of heat transfer with an emphasis on physics and real-world every day applications, while de-emphasizing mathematical aspects. This approach is designed to take advantage of students' intuition, making the learning process easier and more engaging.",
        "InStock": true,
        "Name": "Heat and mass transfer: fundamentals and applications",
        "Stock": 15,
        "Year": 2,
        "_id": "0073398187"
    },
    {
        "Author": "Theodore L. Bergman ,  Adrienne S. Lavine ,  Frank P. Incropera ,  David P. DeWitt",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/eb/e9/85/ebe985ff177850912fb0e80779ba4103.jpg",
        "Department": "Mechanical",
        "Description": "Fundamentals of Heat and Mass Transfer 8th Edition has been the gold standard of heat transfer pedagogy for many decades, with a commitment to continuous improvement by four authors’ with more than 150 years of combined experience in heat transfer education, research and practice. Applying the rigorous and systematic problem-solving methodology that this text pioneered an abundance of examples and problems reveal the richness and beauty of the discipline. This edition makes heat and mass transfer more approachable by giving additional emphasis to fundamental concepts, while highlighting the relevance of two of today’s most critical issues: energy and the environment.",
        "InStock": true,
        "Name": "Fundamentals of Heat and Mass Transfer",
        "Stock": 21,
        "Year": 2,
        "_id": "978-1118989173"
    },
    {
        "Author": "Antonio Carlos Zambroni de Souza ,  Miguel Castilla",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/c1/dc/da/c1dcdac0e9a6210e71496c9df78e1ae9.jpg",
        "Department": "EEE",
        "Description": "This book addresses the emerging trend of smart grids in power systems. It discusses the advent of smart grids and selected technical implications; further, by combining the perspectives of researchers from Europe and South America, the book captures the status quo of and approaches to smart grids in a wide range of countries. It describes the basic concepts, enabling readers to understand the theoretical aspects behind smart grid formation, while also examining current challenges and philosophical discussions.\n Like the industrial revolution and the birth of the Internet, smart grids are certain to change the way people use electricity. In this regard, a new term – the “prosumer” – is used to describe consumers who may sometimes also be energy producers. This is particularly appealing if we bear in mind that most of the distributed power generation in smart grids does not involve carbon emissions. \nAt first glance, the option of generating their own power could move consumers to leave their current energy provider. Yet the authors argue that doing so is not a wise choice: utilities will play a central role in this new scenario and should not be ignored.",
        "InStock": false,
        "Name": "Microgrids Design and Implementation",
        "Stock": 0,
        "Year": 2,
        "_id": "978-3-319-98687-6"
    },
    {
        "Author": "Nikos Hatziargyriou",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/4f/8d/d1/4f8dd159adc675a9ce25bbb4ce08967c.jpg",
        "Department": "EEE",
        "Description": "Microgrids are the most innovative area in the electric power industry today. Future microgrids could exist as energy-balanced cells within existing power distribution grids or stand-alone power networks within small communities. \nA definitive presentation on all aspects of microgrids, this text examines the operation of microgrids – their control concepts and advanced architectures including multi-microgrids. It takes a logical approach to overview the purpose and the technical aspects of microgrids, discussing the social, economic and environmental benefits to power system operation. The book also presents microgrid design and control issues, including protection and explaining how to implement centralized and decentralized control strategies.\nKey features:\noriginal, state-of-the-art research material written by internationally respected contributors \nunique case studies demonstrating success stories from real-world pilot sites from Europe, the Americas, Japan and China\nexamines market and regulatory settings for microgrids, and provides evaluation results under standard test conditions\na look to the future – technical solutions to maximize the value of distributed energy along with the principles and criteria for developing commercial and regulatory frameworks for microgrids\nOffering broad yet balanced coverage, this volume is an entry point to this very topical area of power delivery for electric power engineers familiar with medium and low voltage distribution systems, utility operators in microgrids, power systems researchers and academics. It is also a useful reference for system planners and operators, manufacturers and network operators, government regulators, and postgraduate power systems students.\nCONTRIBUTORS\nThomas Degner\nAris Dimeas\nAlfred Engler\nNuno Gil\nAsier Gil de Muro\nGuillermo Jiménez-Estévez\nGeorge Kariniotakis\nGeorge Korres\nAndré Madureira\nMeiqin Mao\nChris Marnay\nJose Miguel Yarza\nSatoshi Morozumi\nAlexander Oudalov\nFrank van Overbeeke\nRodrigo Palma Behnke\nJoao Abel Pecas Lopes\nFernanda Resende\nJohn Romankiewicz\nChristine Schwaegerl\nNikos Soultanis\nLiang Tao\nAntonis Tsikalakis\nContent: \nChapter 1 The Microgrids Concept (pages 1–24): Christine Schwaegerl and Liang Tao\nChapter 2 Microgrids Control Issues (pages 25–80): Aris Dimeas, Antonis Tsikalakis, George Kariniotakis and George Korres\nChapter 3 Intelligent Local Controllers (pages 81–116): Thomas Degner, Nikos Soultanis, Alfred Engler and Asier Gil de Muro\nChapter 4 Microgrid Protection (pages 117–164): Alexander Oudalov, Thomas Degner, Frank van Overbeeke and Jose Miguel Yarza\nChapter 5 Operation of Multi‐Microgrids (pages 165–205): João Abel Peças Lopes, André Madureira, Nuno Gil and Fernanda Resende\nChapter 6 Pilot Sites: Success Stories and Learnt Lessons (pages 206–274): George Kariniotakis, Aris Dimeas and Frank Van Overbeeke (Sections 6.1, 6.2)\nChapter 7 Quantification of Technical, Economic, Environmental and Social Benefits of Microgrid Operation (pages 275–313): Christine Schwaegerl and Liang Tao",
        "InStock": true,
        "Name": "Microgrids: Architectures and Control",
        "Stock": 18,
        "Year": 2,
        "_id": "1118720687"
    },
    {
        "Author": "Catherine ,  Dr. Dawson",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/54/98/16/549816a9bb02de3a67609354774ab788.jpg",
        "Department": "General",
        "Description": "This practical, down-to-earth guide is for researchers, students, community groups, charities or employees - in fact anyone who needs to put together research projects quickly and effectively. It contains everything from developing your idea into a proposal, through to analysing data and reporting results. Whether you have to undertake a project as part of your coursework, or as part of your employment, or simply because you are fascinated by something you have observed and want to find out more, this book offers you advice on how to turn your ideas into a workable project. Specifically it will show you how to: - choose your research methods - choose your participants - prepare a research proposal - construct questionnaires - conduct interviews and focus groups - analyse your data - report your findings - be an ethical researcher.",
        "InStock": true,
        "Name": "Introduction to Research Methods: A Practical Guide for Anyone Undertaking a Research Project",
        "Stock": 29,
        "Year": 2,
        "_id": "1845283678"
    },
    {
        "Author": "James P. Lewis",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/8f/ec/61/8fec61b4ed50e4f67494a46634cb8380.jpg",
        "Department": "General",
        "Description": "All you need to execute a project perfectly        A new edition of the classic project management book is here, revised and updated with even more guidelines and real-world examples. This expanded fifth edition provides an applications-oriented understanding of the issues you must confront and important tips for passing the Project Management Professional exam.        The standard guidebook in the Project Management field for over 20 years Project Planning Scheduling and Control now offers more strategies for dealing effectively with team members, clients, senior managers and other key stakeholders and is the perfect prescription for project success.\nNEW TO THIS EDITION:    Chapters on Full-spectrum Project Management and how to manage a virtual project team    Managing and facilitating project meetings    Techniques for dealing with contractors    Guidelines for setting up a project office",
        "InStock": true,
        "Name": "Project Planning, Scheduling & Control",
        "Stock": 26,
        "Year": 2,
        "_id": "0071746528"
    },
    {
        "Author": "Jack R. Meredith ,  Scott M. Shafer ,  Samuel J. Mantel ,  Jr.",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/9f/2d/d7/9f2dd733a70ed6d7a48bfd7219c0996d.jpg",
        "Department": "General",
        "Description": "Offering streamlined coverage with an applied approach, Project Management in Practice, 6th Edition focuses on the essentials of project management. This concise, hands-on text is ideal for a one semester project management course, or as a module on project management. This textbook is organized around the project management life cycle, and provides students with essential project management concepts while addressing an important area of industry growth: the use of projects to achieve the strategic goals of organizations.",
        "InStock": true,
        "Name": "Project Management in Practice",
        "Stock": 21,
        "Year": 2,
        "_id": "9781119298632"
    },
    {
        "Author": "Robert K. Wysocki",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/57/b8/82/57b88279b3a1deb06e372fa9931d86cf.jpg",
        "Department": "General",
        "Description": "The popular guide to the project management body of knowledge, now fully updated\n\n\n\r\nNow in its seventh edition, this comprehensive guide to project management has long been considered the standard for both professionals and academics, with nearly 40,000 copies sold in the last three editions! Well-known expert Robert Wysocki has added four chapters of new content based on instructor feedback, enhancing the coverage of best-of-breed methods and tools for ensuring project management success.\n\r\nWith enriched case studies, accompanying exercises and solutions on the companion website, and PowerPoint slides for all figures and tables, the book is ideal for instructors and students as well as active project managers.\n\n\n\r\n• Serves as a comprehensive guide to project management for both educators and project management professionals\n\r\n• Updated to cover the new PMBOK® Sixth Edition \n\r\n• Examines traditional, agile, and extreme project management techniques; the Enterprise Project Management Model; and Kanban and Scrumban methodologies\n\r\n• Includes a companion website with exercises and solutions and well as PowerPoint slides for all the figures and tables used\n\r\n• Written by well-known project management expert Robert Wysocki\n\n\n\r\nEffective Project Management, Eighth Edition remains the comprehensive resource for project management practitioners, instructors, and students.",
        "InStock": true,
        "Name": "Effective Project Management: Traditional, Agile, Extreme, Hybrid",
        "Stock": 10,
        "Year": 2,
        "_id": "1119562805"
    },
    {
        "Author": "George Z. Voyiadjis (eds.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/0e/f3/b5/0ef3b5807182ae64cd498053fc802193.jpg",
        "Department": "Mechanical",
        "Description": "This authoritative reference provides comprehensive coverage of the topics of damage and healing mechanics. Computational modeling of constitutive equations is provided as well as solved examples in engineering applications. A wide range of materials that engineers may encounter are covered, including metals, composites, ceramics, polymers, biomaterials, and nanomaterials. The internationally recognized team of contributors employ a consistent and systematic approach, offering readers a user-friendly reference that is ideal for frequent consultation. \nHandbook of Damage Mechanics: Nano to Macro Scale for Materials and Structures\n is ideal for graduate students and faculty, researchers, and professionals in the fields of Mechanical Engineering, Civil Engineering, Aerospace Engineering, Materials Science, and Engineering Mechanics.",
        "InStock": true,
        "Name": "Handbook of Damage Mechanics: Nano to Macro Scale for Materials and Structures",
        "Stock": 19,
        "Year": 2,
        "_id": "978-1-4614-5589-9"
    },
    {
        "Author": "Bastian E. Rapp (Auth.)",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/fb/a4/06/fba406dfbfdb66cc1ed8c0ca7baa9a9b.gif",
        "Department": "Mechanical",
        "Description": "This practical, lab-based approach to nano- and microfluidics provides readers with a wealth of practical techniques, protocols, and experiments ready to be put into practice in both research and industrial settings. The practical approach is ideally suited to researchers and R&D staff in industry; additionally the interdisciplinary approach to the science of nano- and microfluidics enables readers from a range of different academic disciplines to broaden their understanding.\nDr Rapp fully engages with the multidisciplinary nature of the subject. Alongside traditional fluid/transport topics, there is a wealth of coverage of materials and manufacturing techniques, chemical modification/surface functionalization, biochemical analysis, and the biosensors involved.\nAs well as providing a clear and concise overview to get started into the multidisciplinary field of microfluidics and practical guidance on techniques, pitfalls and troubleshooting, this book supplies:\nA set of hands-on experiments and protocols that will help setting up lab experiments but which will also allow a quick start into practical work.\nA collection of microfluidic structures, with 3D-CAD and image data that can be used directly (files provided on a companion website).",
        "InStock": true,
        "Name": "Microfluidics: Modeling, Mechanics and Mathematics. A volume in Micro and Nano Technologies",
        "Stock": 17,
        "Year": 2,
        "_id": "9781455731411"
    },
    {
        "Author": "Sarhan M. Musa",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/85/6a/64/856a640fa1a1c840ab620bc706fb8b10.jpg",
        "Department": "CSE",
        "Description": "Applications of nanotechnology continue to fuel significant innovations in areas ranging from electronics, microcomputing, and biotechnology to medicine, consumer supplies, aerospace, and energy production. As progress in nanoscale science and engineering leads to the continued development of advanced materials and new devices, improved methods of modeling and simulation are required to achieve a more robust quantitative understanding of matter at the nanoscale.   Computational Nanotechnology: Modeling and Applications with MATLAB® provides expert insights into current and emerging methods, opportunities, and challenges associated with the computational techniques involved in nanoscale research. Written by, and for, those working in the interdisciplinary fields that comprise nanotechnology—including engineering, physics, chemistry, biology, and medicine—this book covers a broad spectrum of technical information, research ideas, and practical knowledge. It presents an introduction to computational methods in nanotechnology, including a closer look at the theory and modeling of two important nanoscale systems: molecular magnets and semiconductor quantum dots.   Topics covered include:      Modeling of nanoparticles and complex nano and MEMS systems      Theory associated with micromagnetics       Surface modeling of thin films      Computational techniques used to validate hypotheses that may not be accessible through traditional experimentation      Simulation methods for various nanotubes and modeling of carbon nanotube and silicon nanowire transistors    In regard to applications of computational nanotechnology in biology, contributors describe tracking of nanoscale structures in cells, effects of various forces on cellular behavior, and use of protein-coated gold nanoparticles to better understand protein-associated nanomaterials. Emphasizing the importance of MATLAB for biological simulations in nanomedicine, this wide-ranging survey of computational nanotechnology concludes by discussing future directions in the field, highlighting the importance of the algorithms, modeling software, and computational tools in the development of efficient nanoscale systems.",
        "InStock": false,
        "Name": "Computational Nanotechnology: Modeling and Applications with MATLAB® (Nano and Energy)",
        "Stock": 0,
        "Year": 2,
        "_id": "1439841764"
    },
    {
        "Author": "M. Morris Mano ,  Michael D. Ciletti",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/89/34/30/89343006d51511d096b73cb7d6fe4fc5.jpg",
        "Department": "ECE",
        "Description": "Digital Design, fifth edition is a modern update of the classic authoritative text on digital design.  This book teaches the basic concepts of digital design in a clear, accessible manner. The book presents the basic tools for the design of digital circuits and provides procedures suitable for a variety of digital applications.",
        "InStock": false,
        "Name": "Digital Design: With an Introduction to the Verilog HDL",
        "Stock": 0,
        "Year": 2,
        "_id": "0132774208"
    },
    {
        "Author": "Yamin Li",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/87/53/15/875315ae2ad6e5563050db41d16724b5.jpg",
        "Department": "ECE",
        "Description": "Uses Verilog HDL to illustrate computer architecture and microprocessor design, allowing readers to readily simulate and adjust the operation of each design, and thus build industrially relevant skills- Introduces the computer principles, computer design, and how to use Verilog HDL (Hardware Description Language) to implement the design- Provides the skills for designing processor/arithmetic/cpu chips, including the unique application of Verilog HDL material for CPU (central processing unit) implementation- Despite the many books on Verilog and computer architecture and microprocessor design, few, if any, use Verilog as a key tool in helping a student to understand these design techniques- A companion website includes color figures, Verilog HDL codes, extra test benches not found in the book, and PDFs of the figures and simulation waveforms for instructors",
        "InStock": true,
        "Name": "Computer Principles and Design in Verilog HDL",
        "Stock": 23,
        "Year": 2,
        "_id": "1118841093"
    },
    {
        "Author": "Joseph Cavanagh",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7d/37/b1/7d37b10d79acf434bb0288a5084830df.jpg",
        "Department": "ECE",
        "Description": "Verilog Hardware Description Language (HDL) is the state-of-the-art method for designing digital and computer systems. Ideally suited to describe both combinational and clocked sequential arithmetic circuits, Verilog facilitates a clear relationship between the language syntax and the physical hardware. It provides a very easy-to-learn and practical means to model a digital system at many levels of abstraction. \n \n \nComputer Arithmetic and Verilog HDL Fundamentals details the steps needed to master computer arithmetic for fixed-point, decimal, and floating-point number representations for all primary operations. Silvaco International’s SILOS, the Verilog simulator used in these pages, is simple to understand, yet powerful enough for any application. It encourages users to quickly prototype and de-bug any logic function and enables single-stepping through the Verilog source code. It also presents drag-and-drop abilities.\n \n \nIntroducing the three main modeling methods—dataflow, behavioral, and structural—this self-contained tutorial—\n \n \n \nCovers the number systems of different radices, such as octal, decimal, hexadecimal, and binary-coded variations\n \n \n \nReviews logic design fundamentals, including Boolean algebra and minimization techniques for switching functions\n \n \n \nPresents basic methods for fixed-point addition, subtraction, multiplication, and division, including the use of decimals in all four operations\n \n \n \nAddresses floating-point addition and subtraction with several numerical examples and flowcharts that graphically illustrate steps required for true addition and subtraction for floating-point operands\n \n \n \nDemonstrates floating-point division, including the generation of a zero-biased exponent\n \n \n \nDesigned for electrical and computer engineers and computer scientists, this book leaves nothing unfinished, carrying design examples through to completion. The goal is practical proficiency. To this end, each chapter includes problems of varying complexity to be designed by the reader.",
        "InStock": false,
        "Name": "Computer Arithmetic and Verilog HDL Fundamentals",
        "Stock": 0,
        "Year": 2,
        "_id": "1439811245"
    },
    {
        "Author": "Norman S. Nise",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/d8/9f/fd/d89ffd2789223fd1b3d1811615d1b3ba.jpg",
        "Department": "ECE",
        "Description": "Control Systems Engineering, 7th Edition\n has become the top selling text for this course. It takes a practical approach, presenting clear and complete explanations. Real world examples demonstrate the analysis and design process, while helpful skill assessment exercises, numerous in-chapter examples, review  questions and problems reinforce key concepts. A new progressive problem, a solar energy  parabolic trough collector, is featured at the end of each chapter. Ten new simulated control lab experiments now complement the online resources that accompany the text. This edition also includes  Hardware Interface Laboratory experiments for use on the MyDAQ platform from National Instruments. A tutorial for MyDAQ is included as Appendix D.",
        "InStock": true,
        "Name": "Control Systems Engineering",
        "Stock": 10,
        "Year": 2,
        "_id": "1118170512"
    },
    {
        "Author": "Richard C. Dorf ,  Robert H. Bishop",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/c8/e3/cd/c8e3cddaacde4e133787ae3edcb36571.jpg",
        "Department": "ECE",
        "Description": "The purpose of Dorf’s Modern Control Systems, Thirteenth Edition is to present the structure of feedback control theory and to provide a sequence of exciting discoveries. The book demonstrates various real-world, global engineering problems while touching on evolving design strategies like green technology. Some of the themes at-hand include climate change, clean water, sustainability, waste management, emissions reduction, and minimizing energy. Throughout the text, the reader applies theory to the design and analysis of control systems. The Thirteenth Edition continues to explore the role of and need for automated and precise control systems in green engineering.  Key examples of green engineering, such as wind turbine control and the modeling of a photovoltaic generator to achieve maximum power delivery, are discussed in detail. The text is organized around the concept of control systems theory in the context of frequency and time domains. Written to be equally useful for all engineering disciplines, it covers topics such as classical control, employing root locus design, frequency and response design using Bode and Nyquist plots.",
        "InStock": true,
        "Name": "Modern Control Systems",
        "Stock": 11,
        "Year": 2,
        "_id": "0134407628"
    },
    {
        "Author": "B. Teraja",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1c/c9/98/1cc9985b00b08a4e953c8b1e3fbd77c8.jpg",
        "Department": "ECE",
        "Description": "Main feature of multicolour illustrated edition: This unique modern textbook presents the material in an integrated manner and logical sequence.\nVol.1. Basic Electrical Engineering\nVol.2. АС & DC Machines",
        "InStock": true,
        "Name": "Textbook of Electrical Technology: AC and DC Machines",
        "Stock": 16,
        "Year": 2,
        "_id": "8121924375"
    },
    {
        "Author": "Bob Dobkin ,  Jim Williams",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/f1/1a/50/f11a5005f854aeeef6d457dd2ef012cb.jpg",
        "Department": "ECE",
        "Description": "* Covers the fundamentals of linear/analog circuit and system design to guide engineers with their design challenges. * Based on the Application Notes of Linear Technology, the foremost designer of high performance analog products, readers will gain practical insights into design techniques and practice. * Broad range of topics, including power management tutorials, switching regulator design, linear regulator design, data conversion, signal conditioning, and high frequency/RF design.  * Contributors include the leading lights in analog design, Robert Dobkin, Jim Williams and Carl Nelson, among others.  * Online support package, including LTspice? software, Design Notes, plus videos and data sheets can be found at www.elsevierdirect.com/companion/9780123851857  Analog circuit and system design today is more essential than ever before. With the growth of digital systems, wireless communications, complex industrial and automotive systems, designers are challenged to develop sophisticated analog solutions. This comprehensive source book of circuit design solutions will aid systems designers with elegant and practical design techniques that focus on common circuit design challenges. The book's in-depth application examples provide insight into circuit design and application solutions that you can apply in today's demanding designs. * Covers the fundamentals of linear/analog circuit and system design to guide engineers with their design challenges. * Based on the Application Notes of Linear Technology, the foremost designer of high performance analog products, readers will gain practical insights into design techniques and practice. * Broad range of topics, including power management tutorials, switching regulator design, linear regulator design, data conversion, signal conditioning, and high frequency/RF design.  * Contributors include the leading lights in analog design, Robert Dobkin, Jim Williams and Carl Nelson, among others.",
        "InStock": true,
        "Name": "Analog Circuit Design: A Tutorial Guide to Applications and Solutions",
        "Stock": 19,
        "Year": 2,
        "_id": "0123851858"
    },
    {
        "Author": "Anant Agarwal ,  Jeffrey Lang",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/79/8a/2b/798a2bcf982a53df766ced0b67b262b8.jpg",
        "Department": "ECE",
        "Description": "Unlike books currently on the market, this book attempts to satisfy two goals: combine circuits and electronics into a single, unified treatment, and establish a strong connection with the contemporary world of digital systems. It will introduce a new way of looking not only at the treatment of circuits, but also at the treatment of introductory coursework in engineering in general.\n\r\nUsing the concept of \"abstraction,\" the book attempts to form a bridge between the world of physics and the world of large computer systems. In particular, it attempts to unify electrical engineering and computer science as the art of creating and exploiting successive abstractions to manage the complexity of building useful electrical systems. Computer systems are simply one type of electrical systems.\n\n\n\r\n• Balances circuits theory with practical digital electronics applications.\n\r\n• Illustrates concepts with real devices.\n\r\n• Supports the popular circuits and electronics course on the MIT OpenCourse Ware from which professionals worldwide study this new approach.\n\r\n• Written by two educators well known for their innovative teaching and research and their collaboration with industry.\n\r\n• Focuses on contemporary MOS technology.",
        "InStock": true,
        "Name": "Foundations of analog and digital electronic circuits",
        "Stock": 27,
        "Year": 2,
        "_id": "1558607358"
    },
    {
        "Author": "Bob Dobkin ,  Jim Williams",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/2c/ea/26/2cea26213b728d42fa4ad60dbee08155.jpg",
        "Department": "ECE",
        "Description": "Analog circuit and system design today is more essential than ever before. With the growth of digital systems, wireless communications, complex industrial and automotive systems, designers are being challenged to develop sophisticated analog solutions. This comprehensive source book of circuit design solutions aids engineers with elegant and practical design techniques that focus on common analog challenges. The book's in-depth application examples provide insight into circuit design and application solutions that you can apply in today's demanding designs. This is the companion volume to the successful Analog Circuit Design: A Tutorial Guide to Applications and Solutions (October 2011), which has sold over 5000 copies in its the first 6 months of since publication. It extends the Linear Technology collection of application notes, which provides analog experts with a full collection of reference designs and problem solving insights to apply to their own engineering challenges.Full support package including online resources (LTSpice). Contents include more application notes on power management, and data conversion and signal conditioning circuit solutions, plus an invaluable circuit collection of reference designs.",
        "InStock": true,
        "Name": "Analog Circuit Design Volume 2: Immersion in the Black Art of Analog Design",
        "Stock": 23,
        "Year": 2,
        "_id": "0123978882"
    },
    {
        "Author": "B. P. Lathi ,  Zhi Ding",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/c2/f4/7d/c2f47de45fb79fb8d8fc3d2ae1844b7a.jpg",
        "Department": "ECE",
        "Description": "Modern Digital and Analog Communication Systems is ideal for the first communication systems course for electrical and computer engineers; it offers its readers a consistently superb pedagogical style and explains complex subjects and concepts clearly, using both mathematics and heuristics. This new edition seamlessly incorporates many new technological advances in Lathi's trademark style of user-friendliness and high readability. The text begins by introducing students to a panoramic view of communication systems, explaining important concepts of communication theory in a heuristic way. Only after a solid introduction to basic communication systems is analysis of communication systems requiring probability and random processes presented. The authors use real world examples to capture the students' attention and enable them to easily relate the course materials with their daily experience of communication tools. The text features easy-to-understand examples and MatLab exercises to clarify mathematical results and proofs. Among the newly introduced topics are spread spectrum communications and orthogonal frequency devision multiplexing (OFDM), error connection coding, soft-decoding, turbo codes and low density parity check (LDPC) codes. To better motivate various topics, the text provides many related applications including the latest wire-line (DSL) services, cellular systems, and the wireless local area networks (LANs). This unique text is highly informative, interactive, and accessible to beginning students as well as seasoned practitioners.",
        "InStock": false,
        "Name": "Modern Digital and Analog Communication Systems",
        "Stock": 0,
        "Year": 2,
        "_id": "0195384938"
    },
    {
        "Author": "Sergio Franco",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/dc/aa/6f/dcaa6f6c3c9d9d62bf18c355ee810d14.jpg",
        "Department": "ECE",
        "Description": "Sergio Franco’s 4th edition of Design with Operational Amplifiers and Analog Integrated Circuits combines theory with real-life applications to deliver a straightforward look at analog design principles and techniques. An emphasis on the physical picture helps the reader develop the intuition and practical insight that are the keys to making sound design decisions. As readers have come to expect, the writing is both plainspoken and helpfully descriptive.\n\n\n\r\nThe book is intended for design-oriented courses in applications with operational amplifiers and analog ICs. It also serves as comprehensive reference for the practicing engineer.",
        "InStock": false,
        "Name": "Design With Operational Amplifiers And Analog Integrated Circuits",
        "Stock": 0,
        "Year": 2,
        "_id": "0078028167"
    },
    {
        "Author": "Cory Beard ,  William Stallings",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/0b/aa/7c/0baa7c61a19f6f8f0c6f24a5f84c76d1.jpg",
        "Department": "CSE",
        "Description": "Wireless Communication Networks and Systems covers all types of wireless communications, from satellite and cellular to local and personal area networks. Organized into four easily comprehensible, reader-friendly parts, it presents a clear and comprehensive overview of the field of wireless communications. For those who are new to the topic, the book explains basic principles and fundamental topics concerning the technology and architecture of the field. Numerous figures and tables help clarify discussions, and each chapter includes a list of keywords, review questions, homework problems, and suggestions for further reading.",
        "InStock": true,
        "Name": "Wireless Communication Networks and Systems",
        "Stock": 25,
        "Year": 2,
        "_id": "978-0133594171"
    },
    {
        "Author": "David Tse ,  Pramod Viswanath",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/70/10/d0/7010d0a3a40f9335b63735114f2ed017.jpg",
        "Department": "ECE",
        "Description": "This textbook takes a unified view of the fundamentals of wireless communication, and explains the web of concepts underpinning these advances at a level accessible to an audience with a basic background in probability and digital communication. Particular emphasis is placed on the interplay between concepts and their implementation in systems. An abundant supply of exercises and figures reinforce the material in the text. This book is intended for use on graduate courses in electrical and computer engineering and will also be of great interest to practicing engineers.",
        "InStock": true,
        "Name": "Fundamentals of Wireless Communication",
        "Stock": 5,
        "Year": 2,
        "_id": "0521845270"
    },
    {
        "Author": "Afif Osseiran ,  Jose F. Monserrat ,  Patrick Marsch",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7e/5e/da/7e5eda99c9a1a8a65d6842e0edbef522.jpg",
        "Department": "ECE",
        "Description": "Written by leading experts in 5G research, this book is a comprehensive overview of the current state of 5G. Covering everything from the most likely use cases, spectrum aspects, and a wide range of technology options to potential 5G system architectures, it is an indispensable reference for academics and professionals involved in wireless and mobile communications. Global research efforts are summarised, and key component technologies including D2D, mm-wave communications, massive MIMO, coordinated multi-point, wireless network coding, interference management and spectrum issues are described and explained. The significance of 5G for the automotive, building, energy, and manufacturing economic sectors is addressed, as is the relationship between IoT, machine type communications, and cyber-physical systems. This essential resource equips you with a solid insight into the nature, impact and opportunities of 5G.\n Editorial Reviews\nReview\n»5G is the biggest opportunity ever for our industry. With capabilities much greater than todays networks, opportunities beyond our imagination will appear. With 5G, we will be able to digitalize industries and realize the full potential of a networked society. New ecosystems will emerge, including new players. To fulfill the expectations on 5G, the industry needs to work in close collaboration with a joint understanding of the technology and its potential. This book is an excellent knowledge base, explaining the potential of 5G and the required technology behind it.»\nUlf Ewaldsson, Senior Vice President and CTO, Ericsson\n»So far, cellular innovation has focused on driving data rates. With 5G, in addition we see the advent of low-latency Tactile Internet and massive IoT generating new opportunities for society. The first comprehensive view on 5G, based mainly on the EU METIS project, this book gives a great insight into challenges and solutions.»\nGerhard Fettweis, Technische Universit?t, Dresden\n»The first comprehensive text on 5G, essential to understand the enabling technologies that will make the future hyper-connected world a reality.»\nNarcis Cardona, Polytechnic University of Valencia\nBook Description\nA comprehensive overview of the current state of 5G. Written by leading experts in 5G research, it covers technology options, most likely use cases and potential system architectures. An essential reference for academics and professionals in wireless communications.\nAbout the Author\nAfif Osseiran is Director of Radio Communications at the Ericsson CTO office. He previously managed the EU 5G flagship project, METIS, and was Technical Manager of the Eureka Celtic project WINNER+. He has co-edited two books on IMT-Advanced and is a senior member of the IEEE.\nJose F. Monserrat is an Associate Professor in the Communications Department at the Polytechnic University of Valencia. He is a senior member of the IEEE and has been involved in several European projects, including NEWCOM, PROSIMOS, WINNER+, METIS and METIS-II.\nPatrick Marsch is a manager at Nokia Networks where he leads a radio research department and is the technical manager of the 5G-PPP project, METIS-II. He was the Technical Project Coordinator of the project EASY-C, where the worlds largest research test beds for LTE-Advanced were established. He is co-editor of Coordinated Multi-Point in Mobile Communications (Cambridge, 2011).",
        "InStock": true,
        "Name": "5G Mobile and Wireless Communications Technology",
        "Stock": 7,
        "Year": 2,
        "_id": "1107130093"
    },
    {
        "Author": "Robert Faludi",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/54/77/c0/5477c0ca5deed4ae2e3bb85834e53351.jpg",
        "Department": "ECE",
        "Description": "Get ready to create distributed sensor systems and intelligent interactive devices using the ZigBee wireless networking protocol and Series 2 XBee radios. By the time you're halfway through this fast-paced, hands-on guide, you'll have built a series of useful projects, including a complete ZigBee wireless network that delivers remotely sensed data.\n Radio networking is creating revolutions in volcano monitoring, performance art, clean energy, and consumer electronics. As you follow the examples in each chapter, you'll learn how to tackle inspiring projects of your own. This practical guide is ideal for inventors, hackers, crafters, students, hobbyists, and scientists.\nInvestigate an assortment of practical and intriguing project ideas \nPrep your ZigBee toolbox with an extensive shopping list of parts and programs \nCreate a simple, working ZigBee network with XBee radios in less than two hours -- for under $100 \nUse the Arduino open source electronics prototyping platform to build a series of increasingly complex projects \nGet familiar with XBee's API mode for creating sensor networks \nBuild fully scalable sensing and actuation systems with inexpensive components \nLearn about power management, source routing, and other XBee technical nuances \nMake gateways that connect with neighboring networks, including the Internet",
        "InStock": true,
        "Name": "Building Wireless Sensor Networks: with ZigBee, XBee, Arduino, and Processing",
        "Stock": 9,
        "Year": 2,
        "_id": "0596807732"
    },
    {
        "Author": "Richard C. Dorf",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/37/8c/04/378c04ff720b0da6b835dfe55f1715c0.jpg",
        "Department": "ECE",
        "Description": "In two editions spanning more than a decade, The Electrical Engineering Handbook stands as the definitive reference to the multidisciplinary field of electrical engineering. Our knowledge continues to grow, and so does the Handbook. For the third edition, it has expanded into a set of six books carefully focused on a specialized area or field of study. Electronics, Power Electronics, Optoelectronics, Microwaves, Electromagnetics, and Radar represents a concise yet definitive collection of key concepts, models, and equations in these areas, thoughtfully gathered for convenient access.    Electronics, Power Electronics, Optoelectronics, Microwaves, Electromagnetics, and Radar delves into the fields of electronics, integrated circuits, power electronics, optoelectronics, electromagnetics, light waves, and radar, supplying all of the basic information required for a deep understanding of each area. It also devotes a section to electrical effects and devices and explores the emerging fields of microlithography and power electronics. Articles include defining terms, references, and sources of further information.    Encompassing the work of the world’s foremost experts in their respective specialties, Electronics, Power Electronics, Optoelectronics, Microwaves, Electromagnetics, and Radar features the latest developments, the broadest scope of coverage, and new material in emerging areas.",
        "InStock": false,
        "Name": "Electronics, Power Electronics, Optoelectronics, Microwaves, Electromagnetics, and Radar (Electrical Engineering Handbook)",
        "Stock": 0,
        "Year": 2,
        "_id": "0849373395"
    },
    {
        "Author": "A.I. Kozlov ,  L.P. Ligthart ,  A.I. Logvin",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/29/4b/bd/294bbd358b92b357aa58dc3839376500.jpg",
        "Department": "Math",
        "Description": "Radar technology is increasingly being used to monitor the environment. This monograph provides a review of polarimetric radar techniques for remote sensing.\n\nThe first four chapters cover the basics of mathematical, statistical modelling as well as physical modelling based on radiowave scattering theory. The subsequent eight chapters summarize applications of polarimetric radar monitoring for various types of earth environments, including vegetation and oceans. The last two chapters provide a summary of Western as well as former Soviet Union knowledge and the outlook.\n\nThis monograph is of value to students, scientists and engineers involved in remote sensing development and applications in particular for environmental monitoring.",
        "InStock": true,
        "Name": "Mathematical and Physical Modelling of Microwave Scattering and Polarimetric Remote Sensing: Monitoring the Earth's Environment Using Polarimetric Radar",
        "Stock": 1,
        "Year": 2,
        "_id": "9048158680"
    },
    {
        "Author": "Andreas C. Müller ,  Sarah Guido",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/36/92/c8/3692c8b9288c21d0247aaad0ca217ded.jpg",
        "Department": "ISE",
        "Description": "Machine learning has become an integral part of many commercial applications and research projects, but this field is not exclusive to large companies with extensive research teams. If you use Python, even as a beginner, this book will teach you practical ways to build your own machine learning solutions. With all the data available today, machine learning applications are limited only by your imagination.\nYou’ll learn the steps necessary to create a successful machine-learning application with Python and the scikit-learn library. Authors Andreas Müller and Sarah Guido focus on the practical aspects of using machine learning algorithms, rather than the math behind them. Familiarity with the NumPy and matplotlib libraries will help you get even more from this book.\nWith this book, you’ll learn:\nFundamental concepts and applications of machine learning\nAdvantages and shortcomings of widely used machine learning algorithms\nHow to represent data processed by machine learning, including which data aspects to focus on\nAdvanced methods for model evaluation and parameter tuning\nThe concept of pipelines for chaining models and encapsulating your workflow\nMethods for working with text data, including text-specific processing techniques\nSuggestions for improving your machine learning and data science skills",
        "InStock": true,
        "Name": "Introduction to Machine Learning with Python: A Guide for Data Scientists",
        "Stock": 20,
        "Year": 2,
        "_id": "1449369413"
    },
    {
        "Author": "Richard E. Neapolitan ,  Xia Jiang",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/66/37/23/663723830d5bcbf344d164b070abcd60.jpg",
        "Department": "ISE",
        "Description": "The first edition of this popular textbook, \nContemporary Artificial Intelligence\n, provided an accessible and student friendly introduction to AI. This fully revised and expanded update, \nArtificial Intelligence: With an Introduction to Machine Learning, Second Edition, \nretains the same accessibility and problem-solving approach, while providing new material and methods.\n \nThe book is divided into five sections that focus on the most useful techniques that have emerged from AI. The first section of the book covers logic-based methods, while the second section focuses on probability-based methods. Emergent intelligence is featured in the third section and explores evolutionary computation and methods based on swarm intelligence. The newest section comes next and provides a detailed overview of neural networks and deep learning. The final section of the book focuses on natural language understanding.\n \nSuitable for undergraduate and beginning graduate students, this class-tested textbook provides students and other readers with key AI methods and algorithms for solving challenging problems involving systems that behave intelligently in specialized domains such as medical and software diagnostics, financial decision making, speech and text recognition, genetic analysis, and more.",
        "InStock": true,
        "Name": "Artificial Intelligence: With an Introduction to Machine Learning",
        "Stock": 13,
        "Year": 2,
        "_id": "1138502383"
    },
    {
        "Author": "Herbert Schildt",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/7f/b0/e5/7fb0e58e87aef95feae8c9d3a986a0a7.jpg",
        "Department": "ISE",
        "Description": "The Definitive Java Programming Guide\n\n\n\r\nFully updated for Java SE 11, Java: The Complete Reference, Eleventh Edition explains how to develop, compile, debug, and run Java programs. Best-selling programming author Herb Schildt covers the entire Java language, including its syntax, keywords, and fundamental programming principles. You’ll also find information on key portions of the Java API library, such as I/O, the Collections Framework, the stream library, and the concurrency utilities. Swing, JavaBeans, and servlets are examined and numerous examples demonstrate Java in action. Of course, the very important module system is discussed in detail. This Oracle Press resource also offers an introduction to JShell, Java’s interactive programming tool. Best of all, the book is written in the clear, crisp, uncompromising style that has made Schildt the choice of millions worldwide.\n\n\n\r\nCoverage includes:\n\n\n\r\n•Data types, variables, arrays, and operators\n\r\n•Control statements\n\r\n•Classes, objects, and methods\n\r\n•Method overloading and overriding\n\r\n•Inheritance\n\r\n•Local variable type inference\n\r\n•Interfaces and packages\n\r\n•Exception handling\n\r\n•Multithreaded programming\n\r\n•Enumerations, autoboxing, and annotations\n\r\n•The I/O classes\n\r\n•Generics\n\r\n•Lambda expressions\n\r\n•Modules\n\r\n•String handling\n\r\n•The Collections Framework\n\r\n•Networking\n\r\n•Event handling\n\r\n•AWT\n\r\n•Swing \n\r\n•The Concurrent API\n\r\n•The Stream API\n\r\n•Regular expressions\n\r\n•JavaBeans\n\r\n•Servlets\n\r\n•Much, much more\n\n\n\r\nCode examples in the book are available for download at www.OraclePressBooks.com.",
        "InStock": true,
        "Name": "Java: The Complete Reference, Eleventh Edition",
        "Stock": 19,
        "Year": 2,
        "_id": "978-1260440232"
    },
    {
        "Author": "Iuliana Cosmina",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/0d/b0/f2/0db0f2eae168c600917807d193abdf4a.jpg",
        "Department": "CSE",
        "Description": "Write your first code in Java using simple, step-by-step examples that model real-word objects and events, making learning easy. With this book you’ll be able to pick up the concepts without fuss. Java for Absolute Beginners teaches Java development in language anyone can understand, giving you the best possible start. You’ll see clear code descriptions and layout so that you can get your code running as soon as possible. After reading this book, you'll come away with the basics to get started writing programs in Java.\n\r\nAuthor Iuliana Cosmina focuses on practical knowledge and getting up to speed quickly―all the bits and pieces a novice needs to get started programming in Java. First, you’ll discover how Java is executed, what type of language it is, and what it is good for. With the theory out of the way, you’ll install Java, choose an editor such as IntelliJ IDEA, and write your first simple Java program. Along the way you’ll compile and execute this program so it can run on any platform that supports Java. As part of this tutorial you’ll see how to write high-quality code by following conventions and respecting well-known programming principles, making your projects more professional and efficient.\n\r\nFinally, alongside the core features of Java, you’ll learn skills in some of the newest and most exciting features of the language: Generics, Lambda expressions, modular organization, local-variable type inference, and local variable syntax for Lambda expressions.\n\r\nJava for Absolute Beginners gives you all you need to start your Java 9+ programming journey. No experience necessary.\n\n\n\r\nWhat You'll Learn\n\r\n• Use data types, operators, and the new stream API\n\r\n• Install and use a build tool such as Gradle\n\r\n• Build interactive Java applications with JavaFX \n\r\n• Exchange data using the new JSON APIs \n\r\n• Play with images using multi-resolution APIs\n\r\n• Use the publish-subscribe framework\n\n\n\r\nWho This Book Is For\n\r\nThose who are new to programming and who want to start with Java.",
        "InStock": false,
        "Name": "Java for Absolute Beginners: Learn to Program the Fundamentals the Java 9+ Way",
        "Stock": 0,
        "Year": 2,
        "_id": "1484237773"
    },
    {
        "Author": "Herbert Schildt",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/e0/12/73/e0127350c59cc3ec1f625554f2a68c9c.jpg",
        "Department": "ISE",
        "Description": "A practical introduction to Java programming—fully revised for \nlong-term support release\n Java SE 11\nThoroughly updated for Java Platform Standard Edition 11, this hands-on resource shows, step by step, how to get started programming in Java from the very first chapter. Written by Java guru Herbert Schildt, the book starts with the basics, such as how to create, compile, and run a Java program. From there, you will learn essential Java keywords, syntax, and commands. \n \nJava: A Beginner's Guide, Eighth Edition\n covers the basics and touches on advanced features, including multithreaded programming, generics, Lambda expressions, and Swing. Enumeration, modules, and interface methods are also clearly explained. This Oracle Press guide delivers the appropriate mix of theory and practical coding necessary to get you up and running developing Java applications in no time.\n •Clearly explains all of the new Java SE 11 features •Features self-tests, exercises, and downloadable code samples •Written by bestselling author and leading Java authority Herbert Schildt",
        "InStock": true,
        "Name": "Java: A Beginner’s Guide, Eighth Edition",
        "Stock": 7,
        "Year": 2,
        "_id": "1260440222"
    },
    {
        "Author": "Chris Richardson",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/89/ee/7e/89ee7e714702f24f37427e57bf1b0ce1.jpg",
        "Department": "ISE",
        "Description": "Microservices Patterns teaches enterprise developers and architects how to build applications with the microservice architecture. Rather than simply advocating for the use the microservice architecture, this clearly-written guide takes a balanced, pragmatic approach, exploring both the benefits and drawbacks.\n\n\n\r\nAbout the Technology\n\r\nSuccessfully developing microservices-based applications requires mastering a new set of architectural insights and practices. In this unique book, microservice architecture pioneer and Java Champion Chris Richardson collects, catalogues, and explains 44 patterns that solve problems such as service decomposition, transaction management, querying, and inter-service communication.\n\n\n\r\nAbout the Book\n\r\nMicroservices Patterns teaches you how to develop and deploy production-quality microservices-based applications. This invaluable set of design patterns builds on decades of distributed system experience, adding new patterns for writing services and composing them into systems that scale and perform reliably under real-world conditions. More than just a patterns catalog, this practical guide offers experience-driven advice to help you design, implement, test, and deploy your microservices-based application.\n\n\n\r\nWhat's inside\n\r\n• How (and why!) to use the microservice architecture\n\r\n• Service decomposition strategies\n\r\n• Transaction management and querying patterns\n\r\n• Effective testing strategies\n\r\n• Deployment patterns including containers and serverlessices\n\n\n\r\nAbout the Reader\n\r\nWritten for enterprise developers familiar with standard enterprise application architecture. Examples are in Java.\n\n\n\r\nAbout the Author\n\r\nChris Richardson is a Java Champion, a JavaOne rock star, author of Manning's POJOs in Action, and creator of the original CloudFoundry.com.",
        "InStock": true,
        "Name": "Microservices Patterns: With examples in Java",
        "Stock": 14,
        "Year": 2,
        "_id": "1617294543"
    },
    {
        "Author": "R. Keith Mobley President and CEO of Integrated Systems  Inc.",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1c/67/2f/1c672f3dbaad8f96ed630178d355f89d.jpg",
        "Department": "IPE",
        "Description": "Fluid Power Dynamics is a 12-chapter book in two sections covering the basics of fluid power through hydraulic system components and troubleshooting. The second section covers pneumatics from basics through to troubleshooting.    This is the latest book in a new series published by Butterworth-Heinemann in association with PLANT ENGINEERING magazine. PLANT ENGINEERING fills a unique information need for the men and women who operate and maintain industrial plants: It bridges the information gap between engineering education and practical application. As technology advances at increasingly faster rates, this information service is becoming more and more important. Since its first issue in 1947, PLANT ENGINEERING has stood as the leading problem-solving information source for America's industrial plant engineers, and this book series will effectively contribute to that resource and reputation.",
        "InStock": true,
        "Name": "Fluid Power Dynamics",
        "Stock": 9,
        "Year": 2,
        "_id": "0-7506-7174-2"
    },
    {
        "Author": "John S. Cundiff",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/75/d2/62/75d2625b63b47a6febd9b18471f5f5e6.jpg",
        "Department": "Mechanical",
        "Description": "Engineers not only need to understand the basics of how fluid power components work, but they must also be able to design these components into systems and analyze or model fluid power systems and circuits. There has long been a need for a comprehensive text on fluid power systems, written from an engineering perspective, which is suitable for an undergraduate-level course in fluid power.Fluid Power Circuits and Controls: Fundamentals and Applications encourages students to think of the collection of components as a system. The author illustrates each concept with a circuit diagram, and as each component is discussed, immediately places it in a circuit and analyzes its performance. This approach allows students to immediately apply what they have learned and encourages them to think about how the component operating characteristics interact with the rest of the circuit.Covering all aspects of the industry, this book:oDevelops  the basic concept for power delivery with fluidsoReviews basic concepts of fluid mechanics and discusses the key properties of the fluidsoDiscusses the creation and control of flow and the various methods used to control pressure in a circuitoProvides a detailed example of the classic problem of hydrostatic transmission designoPresents characteristics of auxiliary components and applicable SAE standardsoAddresses pneumatics, focusing on the difference in power transmission for liquid and gasoDiscusses servo valves and proportional valves without requiring a background in automatic controlsThe text is richly illustrated, filled with fully worked example problems, and reinforced with exercises in each chapter. Fluid Power Circuits and Controls offers valuable design experience and the background its readers need to approach real-world fluid power problems with confidence.",
        "InStock": false,
        "Name": "Fluid power circuits and controls: fundamentals and applications",
        "Stock": 0,
        "Year": 2,
        "_id": "0849309247"
    },
    {
        "Author": "Shiva Kumar ,  M. Jamal Deen",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/53/c9/2b/53c92bab1bc44f2e23879eeb66a14d4a.jpg",
        "Department": "ECE",
        "Description": "Fiber-optic communication systems have advanced dramatically over the last four decades, since the era of copper cables, resulting in low-cost and high-bandwidth transmission. Fiber optics is now the backbone of the internet and long-distance telecommunication. Without it we would not enjoy the benefits of high-speed internet, or low-rate international telephone calls.\n \nThis book introduces the basic concepts of fiber-optic communication in a pedagogical way. The important mathematical results are derived by first principles rather than citing research articles. In addition, physical interpretations and real-world analogies are provided to help students grasp the fundamental concepts.\n \nKey Features: \n \n \nLucid explanation of key topics such as fibers, lasers, and photodetectors.\n \nIncludes recent developments such as coherent communication and digital signal processing.\n \nComprehensive treatment of fiber nonlinear transmission.\n \nWorked examples, exercises, and answers.\n \nAccompanying website with PowerPoint slides and numerical experiments in MATLAB.\n \n \nIntended primarily for senior undergraduates and graduates studying fiber-optic communications, the book is also suitable as a professional resource for researchers working in the field of fiber-optic communications.",
        "InStock": true,
        "Name": "Fiber Optic Communications: Fundamentals and Applications",
        "Stock": 1,
        "Year": 2,
        "_id": "0470518677"
    },
    {
        "Author": "Andrew Oliviero ,  Bill Woodward",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/1d/34/e6/1d34e635c8de63229f23df475f6bfdbb.jpg",
        "Department": "ECE",
        "Description": "Develop the skills you need to design and build a reliable, cost–effective cabling infrastructure Fully updated for the growing demand of fiber optics for large–scale communications networks and telecommunication standards, this new edition is organized into two parts. Part I covers LAN Networks and Cabling Systems offers comprehensive coverage on current cabling methodologies and is updated to the latest industry standards. Part II addresses Fiber–Optic Cabling and Components probes deeper into fiber optics, and can be used to prepare for the Fiber Optics Installer (FOI) and/or Fiber Optics Technician (FOT) certifications, two of the Electronic Technician′s Association′s leading certifications. Explains why cutting corners is a bad idea Walks you through the obstacles to high–speed data transfer Encourages you to follow the golden rules of cabling This new edition is the only book you need for current cabling methodologies and standards.",
        "InStock": false,
        "Name": "Cabling: The Complete Guide to Copper and Fiber-Optic Networking",
        "Stock": 0,
        "Year": 2,
        "_id": "1118807324"
    },
    {
        "Author": "Le Nguyen Binh",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/73/49/f9/7349f9363153bd992c2b983c0887b86d.jpg",
        "Department": "ECE",
        "Description": "This book discusses the techniques of processing and manipulating signals propagating in the optical domain. Photonic components essential for photonic processing systems are included as well as the representation of photonic circuits. Photonic signal processors and their applications for the generation of solitons, and the application of these solitons in optically amplified fiber transmission systems, are discussed. Compensation dispersion using a photonic processor, the design of optical filters using photonic processor techniques, and the filtering of microwave signals in the optical domain are illustrated. This new edition will be fully revised and include four new chapters.",
        "InStock": true,
        "Name": "Photonic Signal Processing",
        "Stock": 29,
        "Year": 2,
        "_id": "1498769934"
    },
    {
        "Author": "Stefano Allesina ,  Madlen Wilmes",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/bd/69/8a/bd698a2185ac1f51752fdfd446cf14ef.jpg",
        "Department": "CSE",
        "Description": "A concise introduction to key computing skills for biologists\n\r\nWhile biological data continues to grow exponentially in size and quality, many of today’s biologists are not trained adequately in the computing skills necessary for leveraging this information deluge. In Computing Skills for Biologists, Stefano Allesina and Madlen Wilmes present a valuable toolbox for the effective analysis of biological data.\n\r\nBased on the authors’ experiences teaching scientific computing at the University of Chicago, this textbook emphasizes the automation of repetitive tasks and the construction of pipelines for data organization, analysis, visualization, and publication. Stressing practice rather than theory, the book’s examples and exercises are drawn from actual biological data and solve cogent problems spanning the entire breadth of biological disciplines, including ecology, genetics, microbiology, and molecular biology. Beginners will benefit from the many examples explained step-by-step, while more seasoned researchers will learn how to combine tools to make biological data analysis robust and reproducible. The book uses free software and code that can be run on any platform.\n\r\nComputing Skills for Biologists is ideal for scientists wanting to improve their technical skills and instructors looking to teach the main computing tools essential for biology research in the twenty-first century.\n\n\n\r\n• Excellent resource for acquiring comprehensive computing skills\n\r\n• Both novice and experienced scientists will increase efficiency by building automated and reproducible pipelines for biological data analysis\n\r\n• Code examples based on published data spanning the breadth of biological disciplines\n\r\n• Detailed solutions provided for exercises in each chapter\n\r\n• Extensive companion website",
        "InStock": true,
        "Name": "Computing Skills for Biologists: A Toolbox",
        "Stock": 8,
        "Year": 2,
        "_id": "978-0691167299"
    },
    {
        "Author": "Supratim Choudhuri ,  Michael Kotewicz",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/a4/3a/40/a43a40a74fa2640b4ace2344753c8daa.jpg",
        "Department": "CSE",
        "Description": "Bioinformatics for Beginners\n provides a coherent and friendly treatment of bioinformatics for any student or scientist within biology who has not routinely performed bioinformatic analysis. \nThe book discusses relevant principles needed to understand the theoretical underpinnings of bioinformatic analysis, and demonstrates with examples targeted analysis using freely available web-based software and publicly available databases. Eschewing non-essential information, the work focuses on principles and hands-on analysis and points to many further study options.\nAvoids non-essential coverage yet fully describes the field for beginners - in approximately 200 pages of text\nExplains the molecular basis of evolution to place bioinformatic analysis in biological context\nProvides useful links to the vast resource of publicly available bioinformatic databases and analysis tools\nOver 100 figures aid in concept discovery and illustration",
        "InStock": true,
        "Name": "Bioinformatics for beginners : genes, genomes, molecular evolution, databases and analytical tools",
        "Stock": 4,
        "Year": 2,
        "_id": "0124104711"
    },
    {
        "Author": "Miguel Rocha ,  Pedro G. Ferreira",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/9c/33/87/9c3387840b15b8153fb35c57959d619a.jpg",
        "Department": "CSE",
        "Description": "Bioinformatics Algorithms: Design and Implementation in Python provides a comprehensive book on many of the most important bioinformatics problems, putting forward the best algorithms and showing how to implement them. The book focuses on the use of the Python programming language and its algorithms, which is quickly becoming the most popular language in the bioinformatics field. Readers will find the tools they need to improve their knowledge and skills with regard to algorithm development and implementation, and will also uncover prototypes of bioinformatics applications that demonstrate the main principles underlying real world applications.\n\n\n\r\n• Presents an ideal text for bioinformatics students with little to no knowledge of computer programming\n\r\n• Based on over 12 years of pedagogical materials used by the authors in their own classrooms\n\r\n• Features a companion website with downloadable codes and runnable examples (such as using Jupyter Notebooks) and exercises relating to the book",
        "InStock": true,
        "Name": "Bioinformatics Algorithms: Design and Implementation in Python",
        "Stock": 15,
        "Year": 2,
        "_id": "0128125209"
    },
    {
        "Author": "Alasdair Gilchrist",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/b4/ab/3a/b4ab3a32134b63c721e44c64538313c8.jpg",
        "Department": "CSE",
        "Description": "Explore the current state of the production, processing, and manufacturing industries and discover what it will take to achieve re-industrialization of the former industrial powerhouses that can counterbalance the benefits of cheap labor providers dominating the industrial sector. This book explores the potential for the Internet of Things (IoT), Big Data, Cyber-Physical Systems (CPS), and Smart Factory technologies to replace the still largely mechanical, people-based systems of offshore locations.\nIndustry 4.0: The Industrial Internet of Things\n covers Industry 4.0, a term that encapsulates trends and technologies that could rewrite the rules of manufacturing and production.\nWhat You'll Learn:\nDiscover the Industrial Internet and Industrial Internet of Things\nSee the technologies that must advance to enable Industry 4.0 and learn what is happening today to make that happen\nObserve examples of the implementation of Industry 4.0\nApply some of these case studies\nDiscover the potential to take back the lead in manufacturing, and the potential fallout that could result",
        "InStock": false,
        "Name": "Industry 4.0: The Industrial Internet of Things",
        "Stock": 0,
        "Year": 2,
        "_id": "978-1-4842-2047-4"
    },
    {
        "Author": "Anuradha ,  J. ,  Tripathy ,  B. K",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/c6/00/08/c60008178201c6530f15046c1685db8d.jpg",
        "Department": "CSE",
        "Description": "The term IoT, which was first proposed by Kevin Ashton, a British technologist, in 1999 has the potential to impact everything from new product opportunities to shop floor optimization to factory worker efficiency gains, that will power top-line and bottom-line gains. As IoT technology is being put to diversified use, the current technology needs to be improved to enhance privacy and built secure devices by adopting a security-focused approach, reducing the amount of data collected, increasing transparency and providing consumers with a choice to opt out. Therefore, the current volume has been compiled, in an effort to draw the various issues in IoT, challenges faced and existing solutions so far.\n \n \nKey Points:\n \n• Provides an overview of basic concepts and technologies of IoT with communication technologies ranging from 4G to 5G and its architecture.\n \n• Discusses recent security and privacy studies and social behavior of human beings over IoT.\n \n• Covers the issues related to sensors, business model, principles, paradigms, green IoT and solutions to handle relevant challenges.\n \n• Presents the readers with practical ideas of using IoT, how it deals with human dynamics, the ecosystem, the social objects and their relation.\n \n• Deals with the challenges involved in surpassing diversified architecture, protocol, communications, integrity and security.",
        "InStock": false,
        "Name": "Internet of things (IoT) : technologies, applications, challenges and solutions",
        "Stock": 0,
        "Year": 2,
        "_id": "1351980297"
    },
    {
        "Author": "Gérard Blanchet ,  Maurice Charbit",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/b0/75/0f/b0750f4324da5fdee072bce85fa7d9c0.jpg",
        "Department": "ECE",
        "Description": "This title provides the most important theoretical aspects of Image and Signal Processing (ISP) for both deterministic and random signals. The theory is supported by exercises and computer simulations relating to real applications.     More than 200 programs and functions are provided in the MATLAB® language, with useful comments and guidance, to enable numerical experiments to be carried out, thus allowing readers to develop a deeper understanding of both the theoretical and practical aspects of this subject.",
        "InStock": true,
        "Name": "Digital Signal and Image Processing Using MATLAB",
        "Stock": 21,
        "Year": 2,
        "_id": "1905209134"
    },
    {
        "Author": "Michael Barr ,  Anthony Massa",
        "Book Image": "https://covers.zlibcdn2.com/covers/books/65/2d/69/652d69c4a42b4712f99266b88628579b.jpg",
        "Department": "CSE",
        "Description": "If you have programming experience and a familiarity with C--the dominant language in embedded systems--Programming Embedded Systems, Second Edition is exactly what you need to get started with embedded software. This software is ubiquitous, hidden away inside our watches, DVD players, mobile phones, anti-lock brakes, and even a few toasters. The military uses embedded software to guide missiles, detect enemy aircraft, and pilot UAVs. Communication satellites, deep-space probes, and many medical instruments would have been nearly impossible to create without embedded software. The first edition of Programming Embedded Systems taught the subject to tens of thousands of people around the world and is now considered the bible of embedded programming. This second edition has been updated to cover all the latest hardware designs and development methodologies. The techniques and code examples presented here are directly applicable to real-world embedded software projects of all sorts. Examples use the free GNU software programming tools, the eCos and Linux operating systems, and a low-cost hardware platform specially developed for this book. If you obtain these tools along with Programming Embedded Systems, Second Edition, you'll have a full environment for exploring embedded systems in depth. But even if you work with different hardware and software, the principles covered in this book apply. Whether you are new to embedded systems or have done embedded work before, you'll benefit from the topics in this book, which include:How building and loading programs differ from desktop or server computers Basic debugging techniques--a critical skill when working with minimally endowed embedded systems Handling different types of memory Interrupts, and the monitoring and control of on-chip and external peripherals Determining whether you have real-time requirements, and whether your operating system and application can meet those requirements Task synchronization with real-time operating systems and embedded Linux Optimizing embedded software for size, speed, and power consumption Working examples for eCos and embedded Linux  So whether you're writing your first embedded program, designing the latest generation of hand-held whatchamacalits, or managing the people who do, this book is for you. Programming Embedded Systems will help you develop the knowledge and skills you need to achieve proficiency with embedded software. Praise for the first edition: \"This lively and readable book is the perfect introduction for those venturing into embedded systems software development for the first time. It provides in one place all the important topics necessary to orient programmers to the embedded development process. --Lindsey Vereen, Editor-in-Chief, Embedded Systems Programming",
        "InStock": true,
        "Name": "Programming Embedded Systems: With C and GNU Development Tools, 2nd Edition",
        "Stock": 17,
        "Year": 2,
        "_id": "0596009836"
    }
]